-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Mar 13, 2026 at 08:59 PM
-- Server version: 10.6.12-MariaDB
-- PHP Version: 8.1.17

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `admportalpte_portal`
--

-- --------------------------------------------------------

--
-- Table structure for table `idcard_admin_notes`
--

CREATE TABLE `idcard_admin_notes` (
  `id` int(11) NOT NULL,
  `id_card_number` varchar(13) NOT NULL,
  `admin_name` varchar(100) NOT NULL,
  `note_text` mediumtext NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `idcard_admin_notes`
--

INSERT INTO `idcard_admin_notes` (`id`, `id_card_number`, `admin_name`, `note_text`, `created_at`) VALUES
(1, '7513781132024', 'Unknown Admin', 'ทดสอบระบบ', '2026-03-02 16:38:30'),
(2, '7513781132024', 'Unknown Admin', 'ทดสอบต่อ', '2026-03-02 16:38:35'),
(3, '7513781132024', 'รัฐภูมิ คำแก้ว', 'ทดสอบ', '2026-03-02 16:43:29'),
(4, '1349900877328', 'รัฐภูมิ คำแก้ว', 'บัตรเสร็จแล้ว', '2026-03-02 16:54:06'),
(5, '1449900494355', 'รัฐภูมิ คำแก้ว', 'แก้ไข ตำแหน่ง พิมพ์ผิด', '2026-03-02 23:35:43'),
(6, '1610200069708', 'รัฐภูมิ คำแก้ว', 'แก้ไข ตำแหน่ง พิมพ์ผิด', '2026-03-02 23:35:52'),
(7, '1419902265019', 'รัฐภูมิ คำแก้ว', 'แก้ไข ตำแหน่ง พิมพ์ผิด', '2026-03-02 23:36:01');

-- --------------------------------------------------------

--
-- Table structure for table `idcard_audit_logs`
--

CREATE TABLE `idcard_audit_logs` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `action` varchar(50) NOT NULL,
  `details` text DEFAULT NULL,
  `ip_address` varchar(50) DEFAULT NULL,
  `user_agent` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `idcard_audit_logs`
--

INSERT INTO `idcard_audit_logs` (`id`, `user_id`, `action`, `details`, `ip_address`, `user_agent`, `created_at`) VALUES
(1, 3, 'LOGIN', 'เข้าสู่ระบบผ่าน OAuth', '43.255.63.69', NULL, '2026-02-07 12:11:45'),
(2, 3, 'SUBMIT_REQ', 'ยื่นคำขอทำบัตรใหม่', '43.255.63.69', NULL, '2026-02-07 12:18:13'),
(3, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-07 12:22:22'),
(4, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-07 12:25:04'),
(5, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 1 เป็น READY_PICKUP', '43.255.63.69', NULL, '2026-02-07 12:29:37'),
(6, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 1 เป็น READY_PICKUP', '43.255.63.69', NULL, '2026-02-07 12:29:38'),
(7, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 1 เป็น READY_PICKUP', '43.255.63.69', NULL, '2026-02-07 12:29:38'),
(8, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 1 เป็น READY_PICKUP', '43.255.63.69', NULL, '2026-02-07 12:29:39'),
(9, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 1 เป็น SENT_TO_PRINT', '43.255.63.69', NULL, '2026-02-07 12:33:02'),
(10, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-07 12:57:54'),
(11, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-07 13:24:39'),
(12, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-07 13:28:05'),
(13, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอ: รัฐภูมิ คำแก้ว', '43.255.63.69', NULL, '2026-02-07 13:42:21'),
(14, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-07 13:49:32'),
(15, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 2 เป็น PENDING_APPROVAL', '43.255.63.69', NULL, '2026-02-07 13:49:40'),
(16, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 2 เป็น SENT_TO_PRINT', '43.255.63.69', NULL, '2026-02-07 13:49:45'),
(17, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 2 เป็น READY_PICKUP', '43.255.63.69', NULL, '2026-02-07 13:50:08'),
(18, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-07 13:50:30'),
(19, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอ: ฟำหกดฟห หฟกฟหกฟห', '43.255.63.69', NULL, '2026-02-07 13:53:14'),
(20, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-07 13:53:26'),
(21, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 3 เป็น REJECTED (เหตุผล: รูปหล่อเกิน)', '43.255.63.69', NULL, '2026-02-07 13:53:38'),
(22, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-07 13:54:52'),
(23, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอ: รัฐภูมิ คำแก้ว', '43.255.63.69', NULL, '2026-02-07 14:09:04'),
(24, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอ: รัฐภูมิ คำแก้ว', '43.255.63.69', NULL, '2026-02-07 14:15:26'),
(25, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-07 14:15:43'),
(26, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 4 เป็น REJECTED (เหตุผล: หกด)', '43.255.63.69', NULL, '2026-02-07 14:15:48'),
(27, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 5 เป็น REJECTED (เหตุผล: กหดกหด)', '43.255.63.69', NULL, '2026-02-07 14:15:54'),
(28, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอ: bfdsidj djdhrgrhd', '43.255.63.69', NULL, '2026-02-07 14:18:33'),
(29, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-07 14:35:30'),
(30, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-07 14:35:40'),
(31, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอ: ปกเกล้า มีสติ', '43.255.63.69', NULL, '2026-02-07 14:38:13'),
(32, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-07 14:38:18'),
(33, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 11:08:29'),
(34, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 7 เป็น SENT_TO_PRINT', '43.255.63.69', NULL, '2026-02-16 11:08:53'),
(35, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 11:19:24'),
(36, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 11:37:13'),
(37, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 11:38:39'),
(38, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 11:52:07'),
(39, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 12:07:49'),
(40, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลคำขอ ID: 3 (ฟำหกดฟห หฟกฟหกฟห)', '43.255.63.69', NULL, '2026-02-16 12:14:44'),
(41, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอ: รัฐภูมิ คำแก้ว', '43.255.63.69', NULL, '2026-02-16 12:16:29'),
(42, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 12:16:36'),
(43, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 8 เป็น COMPLETED', '43.255.63.69', NULL, '2026-02-16 12:17:07'),
(44, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอ: รัฐภูมิ คำแก้ว', '43.255.63.69', NULL, '2026-02-16 12:18:48'),
(45, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 12:18:53'),
(46, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอ: รัฐภูมิ คำแก้ว', '43.255.63.69', NULL, '2026-02-16 12:19:26'),
(47, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 12:19:30'),
(48, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 9 เป็น SENT_TO_PRINT', '43.255.63.69', NULL, '2026-02-16 12:21:06'),
(49, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลคำขอ ID: 6 (bfdsidj djdhrgrhd)', '43.255.63.69', NULL, '2026-02-16 12:21:20'),
(50, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลคำขอ ID: 10 (รัฐภูมิ คำแก้ว)', '43.255.63.69', NULL, '2026-02-16 12:45:12'),
(51, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 7 เป็น COMPLETED', '43.255.63.69', NULL, '2026-02-16 12:58:09'),
(52, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 7 (ปกเกล้า มีสติ)', '43.255.63.69', NULL, '2026-02-16 12:59:10'),
(53, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ปกเกล้า มีสติ', '43.255.63.69', NULL, '2026-02-16 13:02:54'),
(54, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 11 เป็น SENT_TO_PRINT', '43.255.63.69', NULL, '2026-02-16 13:03:10'),
(55, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 11 เป็น PENDING_CHECK', '43.255.63.69', NULL, '2026-02-16 13:09:45'),
(56, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 11 เป็น READY_PICKUP', '43.255.63.69', NULL, '2026-02-16 13:09:51'),
(57, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 11 เป็น PENDING_CHECK', '43.255.63.69', NULL, '2026-02-16 13:19:49'),
(58, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 11 เป็น SENT_TO_PRINT', '43.255.63.69', NULL, '2026-02-16 13:19:55'),
(59, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 11 (ปกเกล้า มีสติ)', '43.255.63.69', NULL, '2026-02-16 13:20:18'),
(60, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 10 (รัฐภูมิ คำแก้ว)', '43.255.63.69', NULL, '2026-02-16 13:20:38'),
(61, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: รัฐภูมิ คำแก้ว', '43.255.63.69', NULL, '2026-02-16 13:26:11'),
(62, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 12 เป็น SENT_TO_PRINT', '43.255.63.69', NULL, '2026-02-16 13:29:07'),
(63, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 12 (รัฐภูมิ คำแก้ว)', '43.255.63.69', NULL, '2026-02-16 13:40:06'),
(64, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 12 เป็น READY_PICKUP', '43.255.63.69', NULL, '2026-02-16 13:48:45'),
(65, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: รัฐภูมิ คำแก้ว', '43.255.63.69', NULL, '2026-02-16 14:02:39'),
(66, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 13 (รัฐภูมิ คำแก้ว)', '43.255.63.69', NULL, '2026-02-16 14:03:10'),
(67, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 14 (sdfsdfsd fsdfsdfsdfsdf)', '43.255.63.69', NULL, '2026-02-16 14:23:19'),
(68, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 15 (โชคอานนท์ อรศรี)', '43.255.63.69', NULL, '2026-02-16 14:32:55'),
(69, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: สุรศักดิ์ พรหมศรีจันทร์', '43.255.63.69', NULL, '2026-02-16 14:34:40'),
(70, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 16 เป็น SENT_TO_PRINT', '43.255.63.69', NULL, '2026-02-16 14:34:57'),
(71, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 14:38:22'),
(72, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 14:39:04'),
(73, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 14:48:04'),
(74, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 14:52:24'),
(75, 8, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 14:53:11'),
(76, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 14:58:35'),
(77, 8, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 14:58:57'),
(78, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 15:04:16'),
(79, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 15:05:50'),
(80, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 15:06:21'),
(81, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 21:20:04'),
(82, 3, 'ADMIN_SETTING', 'ตั้งค่าเลขลำดับเริ่มต้น ปี 2569 เป็น 10', '43.255.63.69', NULL, '2026-02-16 21:32:47'),
(83, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 19 (รัฐภูมิ คำแก้ว)', '43.255.63.69', NULL, '2026-02-16 22:04:26'),
(84, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 19 เป็น SENT_TO_PRINT', '43.255.63.69', NULL, '2026-02-16 22:04:31'),
(85, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 19 (รัฐภูมิ คำแก้ว)', '43.255.63.69', NULL, '2026-02-16 22:26:59'),
(86, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 20 (รัฐภูมิ คำแก้ว)', '43.255.63.69', NULL, '2026-02-16 22:28:47'),
(87, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 18 (*** ตั้งค่าเลขเริ่มต้นระบบ)', '43.255.63.69', NULL, '2026-02-16 22:58:25'),
(88, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 20 เป็น PENDING_CHECK', '43.255.63.69', NULL, '2026-02-16 22:59:33'),
(89, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 20 เป็น COMPLETED', '43.255.63.69', NULL, '2026-02-16 22:59:40'),
(90, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 19 เป็น REJECTED (เหตุผล: ทดสอบระบบ)', '43.255.63.69', NULL, '2026-02-16 23:00:07'),
(91, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 19 เป็น PENDING_APPROVAL', '43.255.63.69', NULL, '2026-02-16 23:10:49'),
(92, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 19 เป็น REJECTED (เหตุผล: ทดสอบระบบ)', '43.255.63.69', NULL, '2026-02-16 23:11:08'),
(93, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 23:15:51'),
(94, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 20 เป็น REJECTED (เหตุผล: ทดสอบระบบ)', '43.255.63.69', NULL, '2026-02-16 23:16:06'),
(95, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-16 23:16:45'),
(96, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 20 เป็น SENT_TO_PRINT', '43.255.63.69', NULL, '2026-02-16 23:19:29'),
(97, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 20 เป็น REJECTED (เหตุผล: ทดสอบระบบ)', '43.255.63.69', NULL, '2026-02-16 23:30:43'),
(98, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.116', NULL, '2026-02-17 00:32:43'),
(99, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-17 08:13:06'),
(100, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 20 เป็น SENT_TO_PRINT', '43.255.63.52', NULL, '2026-02-17 08:13:13'),
(101, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 20 เป็น PENDING_CHECK', '43.255.63.52', NULL, '2026-02-17 09:12:59'),
(102, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 20 เป็น READY_PICKUP', '43.255.63.52', NULL, '2026-02-17 09:13:05'),
(103, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 20 เป็น REJECTED (เหตุผล: ทดสอบระบบ)', '43.255.63.52', NULL, '2026-02-17 09:13:22'),
(104, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 21 (สุถิตย์ ซ้ายยศ)', '43.255.63.52', NULL, '2026-02-17 09:14:58'),
(105, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 21 เป็น SENT_TO_PRINT', '43.255.63.52', NULL, '2026-02-17 09:15:05'),
(106, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 21 เป็น REJECTED (เหตุผล: ทดสอบระบบ)', '43.255.63.52', NULL, '2026-02-17 09:15:40'),
(107, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 22 (ปริญญา รัศมีวิศิษฎ์ปัญญา)', '43.255.63.52', NULL, '2026-02-17 09:17:05'),
(108, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 22 เป็น SENT_TO_PRINT', '43.255.63.52', NULL, '2026-02-17 09:17:17'),
(109, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 22 เป็น REJECTED (เหตุผล: ทดสอบระบบ)', '43.255.63.52', NULL, '2026-02-17 09:28:12'),
(110, 3, 'ADMIN_SETTING', 'ตั้งค่าเลขลำดับเริ่มต้น ปี 2569 เป็น 47', '43.255.63.52', NULL, '2026-02-17 09:31:48'),
(111, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 24 (ศุภชัย ศรีสุระ)', '43.255.63.52', NULL, '2026-02-17 09:33:36'),
(112, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 24 (ศุภชัย ศรีสุระ)', '43.255.63.52', NULL, '2026-02-17 09:33:50'),
(113, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 24 เป็น READY_PICKUP', '43.255.63.52', NULL, '2026-02-17 09:40:59'),
(114, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 25 (พิทักษ์พล อากาศไชย)', '43.255.63.52', NULL, '2026-02-17 09:43:22'),
(115, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 25 เป็น READY_PICKUP', '43.255.63.52', NULL, '2026-02-17 09:44:36'),
(116, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 26 (มนตรี แก้วใส)', '43.255.63.52', NULL, '2026-02-17 09:46:01'),
(117, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 26 เป็น READY_PICKUP', '43.255.63.52', NULL, '2026-02-17 09:47:31'),
(118, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 27 (ธีระพงศ์ ธาระนารถ)', '43.255.63.52', NULL, '2026-02-17 09:49:59'),
(119, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 27 เป็น READY_PICKUP', '43.255.63.52', NULL, '2026-02-17 09:59:03'),
(120, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-17 10:34:37'),
(121, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: sdfds dsfdsf', '43.255.63.69', NULL, '2026-02-17 11:28:09'),
(122, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 28 เป็น REJECTED (เหตุผล: ทดสอบระบบ)', '43.255.63.69', NULL, '2026-02-17 11:34:40'),
(123, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: หอกหอ หกอกหอหกอ', '43.255.63.69', NULL, '2026-02-17 11:36:40'),
(124, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 29 (หอกหอ หกอกหอหกอ)', '43.255.63.69', NULL, '2026-02-17 11:44:27'),
(125, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 27 (ธีระพงศ์ ธาระนารถ)', '43.255.63.69', NULL, '2026-02-17 12:12:30'),
(126, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธีระพงศ์ ธาระนารถ', '43.255.63.69', NULL, '2026-02-17 12:34:54'),
(127, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 30 เป็น REJECTED (เหตุผล: ทดสอบระบบซ้ำ)', '43.255.63.69', NULL, '2026-02-17 12:35:35'),
(128, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 27 (ธีระพงศ์ ธาระนารถ)', '43.255.63.69', NULL, '2026-02-17 12:38:54'),
(129, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธีระพงศ์ ธาระนารถ', '43.255.63.69', NULL, '2026-02-17 12:40:29'),
(130, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธีระพงศ์ ธาระนารถ', '43.255.63.69', NULL, '2026-02-17 12:58:30'),
(131, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธีระพงศ์ ธาระนารถ', '43.255.63.69', NULL, '2026-02-17 13:38:27'),
(132, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธีระพงศ์ ธาระนารถ', '43.255.63.69', NULL, '2026-02-17 13:57:17'),
(133, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 27 (ธีระพงศ์ ธาระนารถ)', '43.255.63.69', NULL, '2026-02-17 14:42:42'),
(134, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-17 14:54:46'),
(135, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธีระพงศ์ ธาระนารถ', '43.255.63.69', NULL, '2026-02-17 14:56:31'),
(136, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 35 เป็น REJECTED (เหตุผล: ทดสอบ)', '43.255.63.69', NULL, '2026-02-17 14:58:25'),
(137, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 36 (อแ ิแกดอิ กดเิดิกดิ)', '43.255.63.69', NULL, '2026-02-17 15:20:26'),
(138, 3, 'EDIT_REQUEST', 'แก้ไขคำขอ: อแ ิแกดอิ', '43.255.63.69', NULL, '2026-02-17 15:21:43'),
(139, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: dsvds sdvsdvsdv', '43.255.63.69', NULL, '2026-02-17 15:23:58'),
(140, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.69', NULL, '2026-02-17 23:22:27'),
(141, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-18 08:35:57'),
(142, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ยศศักดิ์ สุจินพลัม', '43.255.63.52', NULL, '2026-02-18 09:20:33'),
(143, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 38 (ยศศักดิ์ สุจินพลัม)', '43.255.63.52', NULL, '2026-02-18 09:20:47'),
(144, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 38 เป็น READY_PICKUP', '43.255.63.52', NULL, '2026-02-18 09:28:01'),
(145, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 39 (เทียมทัศน์ เส้งสุ้น)', '43.255.63.52', NULL, '2026-02-18 09:32:28'),
(146, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 39 (เทียมทัศน์ เส้งสุ้น)', '43.255.63.52', NULL, '2026-02-18 09:35:34'),
(147, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 40 (บุษยา จับศรทิพย์)', '43.255.63.52', NULL, '2026-02-18 09:38:53'),
(148, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 41 (ถนอม ชุมแสง)', '43.255.63.52', NULL, '2026-02-18 09:48:40'),
(149, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 40 เป็น READY_PICKUP', '43.255.63.52', NULL, '2026-02-18 09:49:39'),
(150, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 41 เป็น READY_PICKUP', '43.255.63.52', NULL, '2026-02-18 09:52:01'),
(151, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 42 (โสภัณ หนูน้อย)', '43.255.63.52', NULL, '2026-02-18 09:53:36'),
(152, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 42 (โสภัณ หนูน้อย)', '43.255.63.52', NULL, '2026-02-18 09:53:58'),
(153, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 42 เป็น READY_PICKUP', '43.255.63.52', NULL, '2026-02-18 09:54:55'),
(154, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 43 (วรุฒม์ มาเบ้า)', '43.255.63.52', NULL, '2026-02-18 09:56:32'),
(155, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 43 เป็น READY_PICKUP', '43.255.63.52', NULL, '2026-02-18 09:56:53'),
(156, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 43 เป็น SENT_TO_PRINT', '43.255.63.52', NULL, '2026-02-18 10:06:27'),
(157, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 43 เป็น READY_PICKUP', '43.255.63.52', NULL, '2026-02-18 10:06:40'),
(158, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.98', NULL, '2026-02-18 11:29:29'),
(159, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.116', NULL, '2026-02-18 12:24:42'),
(160, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.8', NULL, '2026-02-18 14:23:03'),
(161, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-18 22:02:34'),
(162, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-18 23:06:55'),
(163, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-19 02:56:39'),
(164, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 43 เป็น PENDING_CHECK', '43.255.63.52', NULL, '2026-02-19 02:57:12'),
(165, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 43 เป็น SENT_TO_PRINT', '43.255.63.52', NULL, '2026-02-19 02:57:20'),
(166, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 43 เป็น READY_PICKUP', '43.255.63.52', NULL, '2026-02-19 02:57:31'),
(167, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-19 03:02:35'),
(168, 16, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-19 03:03:59'),
(169, 16, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-19 03:05:22'),
(170, 16, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-19 03:06:47'),
(171, 16, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-19 03:23:46'),
(172, 16, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-19 03:31:28'),
(173, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-19 03:32:00'),
(174, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-19 03:33:53'),
(175, 17, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-19 03:39:17'),
(176, 17, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 44 (จาตุรงค์ บุญหนัก)', '43.255.63.52', NULL, '2026-02-19 03:46:18'),
(177, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-19 03:50:40'),
(178, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 44 (จาตุรงค์ บุญหนัก)', '43.255.63.52', NULL, '2026-02-19 03:50:50'),
(179, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 44 เป็น READY_PICKUP', '43.255.63.52', NULL, '2026-02-19 03:51:53'),
(180, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 44 เป็น COMPLETED', '43.255.63.52', NULL, '2026-02-19 03:52:05'),
(181, 16, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-19 07:31:50'),
(182, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-19 10:25:43'),
(183, 8, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-19 10:26:17'),
(184, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-19 10:27:36'),
(185, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-19 10:27:49'),
(186, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-19 12:10:31'),
(187, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-19 12:10:41'),
(188, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-19 13:06:44'),
(189, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-19 13:42:36'),
(190, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-19 23:42:32'),
(191, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-20 06:52:49'),
(192, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 25 เป็น COMPLETED', '43.255.63.52', NULL, '2026-02-20 06:52:59'),
(193, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 26 เป็น COMPLETED', '43.255.63.52', NULL, '2026-02-20 06:53:04'),
(194, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 27 เป็น COMPLETED', '43.255.63.52', NULL, '2026-02-20 06:53:08'),
(195, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 38 เป็น COMPLETED', '43.255.63.52', NULL, '2026-02-20 06:53:14'),
(196, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 39 เป็น COMPLETED', '43.255.63.52', NULL, '2026-02-20 06:53:27'),
(197, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 40 เป็น COMPLETED', '43.255.63.52', NULL, '2026-02-20 06:53:33'),
(198, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 41 เป็น COMPLETED', '43.255.63.52', NULL, '2026-02-20 06:53:40'),
(199, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 42 เป็น COMPLETED', '43.255.63.52', NULL, '2026-02-20 06:53:50'),
(200, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 43 เป็น COMPLETED', '43.255.63.52', NULL, '2026-02-20 06:53:54'),
(201, 3, 'ADMIN_UPDATE', 'เปลี่ยนสถานะคำขอ ID 24 เป็น COMPLETED', '43.255.63.52', NULL, '2026-02-20 06:54:11'),
(202, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: นนทิกานต์ เหล่ากาวี', '43.255.63.111', NULL, '2026-02-20 09:33:45'),
(203, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ชิษณุพงศ์ ศรีรักษ์', '43.255.63.26', NULL, '2026-02-20 09:40:45'),
(204, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.74', NULL, '2026-02-20 09:42:11'),
(205, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธวัชชัย ภาคี', '43.255.63.10', NULL, '2026-02-20 09:42:37'),
(206, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: จักราวุธ ศิริกิจ', '43.255.63.54', NULL, '2026-02-20 10:07:17'),
(207, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-20 10:10:24'),
(208, 3, 'ADMIN_EDIT', 'แก้ไขข้อมูลและสถานะคำขอ ID: 47 (ธวัชชัย ภาคี)', '43.255.63.19', NULL, '2026-02-20 10:11:20'),
(209, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-20 10:30:29'),
(210, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.74', NULL, '2026-02-20 10:31:47'),
(211, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ศักรินทร์ สีเที่ยง', '43.255.63.31', NULL, '2026-02-20 10:51:18'),
(212, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: นันทิพัฒน์ เชาว์เจริญ', '43.255.63.92', NULL, '2026-02-20 11:00:04'),
(213, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-20 11:02:18'),
(214, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: อชิระ ศรีชื่น', '43.255.63.12', NULL, '2026-02-20 11:02:38'),
(215, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ชิษณุพงศ์ ศรีรักษ์', '43.255.63.12', NULL, '2026-02-20 11:06:09'),
(216, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: อภิรักษ์ อุนาภาค', '43.255.63.76', NULL, '2026-02-20 11:16:47'),
(217, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: กฤษณะ กองนาคู', '43.255.63.70', NULL, '2026-02-20 11:18:32'),
(218, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: นันทิพัฒน์ เชาว์เจริญ', '43.255.63.92', NULL, '2026-02-20 11:21:46'),
(219, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-20 11:43:58'),
(220, 8, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-20 12:14:45'),
(221, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธนกฤต ไสยาสน์', '43.255.63.68', NULL, '2026-02-20 12:22:36'),
(222, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ธนกฤต ไสยาสน์', '43.255.63.68', NULL, '2026-02-20 12:26:02'),
(223, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: รัฐภูมิ คำแก้ว', '43.255.63.19', NULL, '2026-02-20 12:26:11'),
(224, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-20 12:26:44'),
(225, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-20 12:36:08'),
(226, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ธนกฤต ไสยาสน์', '43.255.63.68', NULL, '2026-02-20 12:41:14'),
(227, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: อดิศร อ่อนณะนัย', '43.255.63.118', NULL, '2026-02-20 12:47:40'),
(228, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: กิตติพศ ทิพย์สุวรรณ์', '43.255.63.98', NULL, '2026-02-20 12:52:17'),
(229, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธนภัทร บุษมงคล', '43.255.63.118', NULL, '2026-02-20 14:40:28'),
(230, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: สหัศวรรษ ช่างฝั้น', '43.255.63.50', NULL, '2026-02-20 14:42:37'),
(231, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ชินวัตร โพธิ์หงอก', '43.255.63.46', NULL, '2026-02-20 15:33:05'),
(232, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ภานุกร หนันเมาผาง', '43.255.63.6', NULL, '2026-02-20 15:35:00'),
(233, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธนชิต สามสี', '43.255.63.36', NULL, '2026-02-20 15:35:00'),
(234, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: นิพนธ์ เพ็งบุญทัศน์', '43.255.63.89', NULL, '2026-02-20 16:39:31'),
(235, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-20 23:18:01'),
(236, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-20 23:37:27'),
(237, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-21 00:58:08'),
(238, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ชุติพนธ์ พลหนองหลวง', '43.255.63.110', NULL, '2026-02-21 04:51:51'),
(239, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: เขตตะวัน ต้นเขียว', '43.255.63.101', NULL, '2026-02-21 05:28:01'),
(240, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ณัฐวุฒิ นาถ้ำเพชร', '43.255.63.114', NULL, '2026-02-21 05:35:09'),
(241, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ก้องกิดากานต์ มานะพิมพ์', '43.255.63.90', NULL, '2026-02-21 06:09:44'),
(242, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ภูวดล พรมสวัสดิ์', '43.255.63.122', NULL, '2026-02-21 06:13:23'),
(243, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: บัญชาพล มั่งมี', '43.255.63.8', NULL, '2026-02-21 07:53:33'),
(244, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: จีรภัทร ศรีทะนาม', '43.255.63.54', NULL, '2026-02-21 08:46:18'),
(245, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: อนุชา กุดน้อย', '43.255.63.58', NULL, '2026-02-21 08:49:02'),
(246, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: วรัญญู เจริญภูมิ', '43.255.63.114', NULL, '2026-02-21 12:31:15'),
(247, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-21 13:56:38'),
(248, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ณัฐวุฒิ โคกลือชา', '43.255.63.32', NULL, '2026-02-21 14:03:30'),
(249, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-21 14:03:44'),
(250, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-21 14:15:02'),
(251, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: กฤตินัย ยงเขตรการณ์', '43.255.63.52', NULL, '2026-02-21 15:21:13'),
(252, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-21 17:16:53'),
(253, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-21 17:18:03'),
(254, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-21 17:18:17'),
(255, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-21 18:42:10'),
(256, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-21 22:49:57'),
(257, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-22 02:24:13'),
(258, 16, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-22 07:37:16'),
(259, 16, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-22 07:41:27'),
(260, 16, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 75 (กฤษฎา บุรณรังษี)', '43.255.63.52', NULL, '2026-02-22 07:47:36'),
(261, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 12:19:32'),
(262, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ (Vue 3)', '124.120.182.240', NULL, '2026-02-22 12:26:56'),
(263, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ (Vue 3)', '124.120.182.240', NULL, '2026-02-22 12:27:04'),
(264, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 12:48:01'),
(265, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 12:56:38'),
(266, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 12:59:50'),
(267, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 13:00:11'),
(268, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 13:01:06'),
(269, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 13:02:01'),
(270, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 13:02:26'),
(271, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 13:04:19'),
(272, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 14:01:37'),
(273, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 14:02:03'),
(274, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 14:02:20'),
(275, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 21:57:51'),
(276, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-22 23:38:00'),
(277, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: เอกชัย บุตราช', '43.255.63.36', NULL, '2026-02-23 03:38:51'),
(278, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: พงศ์พล โยธินธนากร', '43.255.63.108', NULL, '2026-02-23 05:59:10'),
(279, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: อับดุลฮากีม นาแว', '43.255.63.52', NULL, '2026-02-23 08:34:24'),
(280, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ศุภวิชญ์ บูรณ์เจริญ', '43.255.63.30', NULL, '2026-02-23 08:47:50'),
(281, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ชัยธวัฒน์ ศรีชุมพร', '43.255.63.26', NULL, '2026-02-23 09:51:22'),
(282, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-23 12:12:08'),
(283, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: วิศรุจร์ ปทุมทอง', '43.255.63.102', NULL, '2026-02-23 12:55:40'),
(284, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.124', NULL, '2026-02-23 13:21:11'),
(285, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-23 13:57:07'),
(286, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: วีระวัฒน์ บุญจริง', '43.255.63.10', NULL, '2026-02-23 15:16:35'),
(287, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ศุภกรณ์ ก่อเกิด', '43.255.63.116', NULL, '2026-02-23 15:45:52'),
(288, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.19', NULL, '2026-02-23 22:55:11'),
(289, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: เอกลักษณ์ จันอุไรรัตน์', '43.255.63.72', NULL, '2026-02-24 02:16:40'),
(290, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ชัยวัฒน์ มาลาเอี่ยม', '43.255.63.16', NULL, '2026-02-24 04:13:08'),
(291, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธนวัต ฤกษ์ใหญ่', '43.255.63.11', NULL, '2026-02-24 05:48:53'),
(292, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ภูวดล พรมสวัสดิ์', '43.255.63.122', NULL, '2026-02-24 05:57:05'),
(293, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-24 07:39:14'),
(294, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 87 (ณัฐวัฒน์ สีตาลเดี่ยว)', '43.255.63.52', NULL, '2026-02-24 09:06:30'),
(295, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 88 (เดโชชัย สุวรรณ)', '43.255.63.52', NULL, '2026-02-24 09:09:57'),
(296, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: จีรภัทร ศรีทะนาม', '43.255.63.4', NULL, '2026-02-24 09:12:35'),
(297, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: อนุชา กุดน้อย', '43.255.63.16', NULL, '2026-02-24 09:13:51'),
(298, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 89 (ชาญณรงค์ เสาร์แดน)', '43.255.63.52', NULL, '2026-02-24 09:15:38'),
(299, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: รัฐพล สุวรรณ', '43.255.63.88', NULL, '2026-02-24 09:15:56'),
(300, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ศักดินันท์ พึ่งกิจ', '43.255.63.106', NULL, '2026-02-24 09:17:05'),
(301, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 92 (ณภัทร แสงศรีจันทร์รัตน์)', '43.255.63.52', NULL, '2026-02-24 09:19:06'),
(302, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: นันทิพัฒน์ เชาว์เจริญ', '43.255.63.69', NULL, '2026-02-24 09:20:35'),
(303, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-24 09:28:14'),
(304, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-24 09:42:39'),
(305, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-24 09:44:57'),
(306, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.84', NULL, '2026-02-24 09:54:14'),
(307, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: อภิรักษ์ อุนาภาค', '43.255.63.120', NULL, '2026-02-24 10:21:56'),
(308, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ชนพล เชาว์พลกรัง', '43.255.63.56', NULL, '2026-02-24 10:34:49'),
(309, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธนศักดิ์ ลีนุกูล', '43.255.63.26', NULL, '2026-02-24 11:07:44'),
(310, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.112', NULL, '2026-02-24 11:50:58'),
(311, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.96', NULL, '2026-02-24 14:44:26'),
(312, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ธวัชชัย ภาคี', '43.255.63.94', NULL, '2026-02-24 16:08:56'),
(313, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: จักราวุธ ศิริกิจ', '43.255.63.28', NULL, '2026-02-24 17:10:10'),
(314, 17, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-25 01:35:23'),
(315, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-25 02:16:00'),
(316, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ภูริภัทร บุญเทพ', '43.255.63.94', NULL, '2026-02-25 02:58:57'),
(317, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: วิรุฬห์ ไชยคิรินทร์', '43.255.63.24', NULL, '2026-02-25 03:02:26'),
(318, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: นันทิพัฒน์ เชาว์เจริญ', '43.255.63.22', NULL, '2026-02-25 03:10:15'),
(319, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ชนนน แก้วมา', '43.255.63.65', NULL, '2026-02-25 03:29:08'),
(320, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ก้องภพ พรมรส', '43.255.63.11', NULL, '2026-02-25 04:18:43'),
(321, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ธนวัต ฤกษ์ใหญ่', '43.255.63.11', NULL, '2026-02-25 05:03:58'),
(322, 16, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-25 05:06:23'),
(323, 16, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 99 (เฉลิมศักดิ์ น้อยชื่น)', '43.255.63.52', NULL, '2026-02-25 05:17:03'),
(324, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธรวิชญ์ สินศิริ', '43.255.63.60', NULL, '2026-02-25 07:58:27'),
(325, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-25 09:12:09'),
(326, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-25 09:31:29'),
(327, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-25 09:53:15'),
(328, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: รัฐภูมิ คำแก้ว', '43.255.63.52', NULL, '2026-02-25 10:20:54'),
(329, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-02-25 10:21:01'),
(330, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-25 11:20:37'),
(331, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-25 11:52:26'),
(332, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: รัฐภูมิ คำแก้ว', '43.255.63.41', NULL, '2026-02-25 12:03:53'),
(333, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-25 12:04:03'),
(334, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: รัฐภูมิ คำแก้ว', '43.255.63.41', NULL, '2026-02-25 12:19:52'),
(335, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-25 12:22:19'),
(336, 3, 'EDIT_REQUEST', 'แก้ไขคำขอ: รัฐภูมิ คำแก้ว', '43.255.63.41', NULL, '2026-02-25 12:23:11'),
(337, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: บัญชาพล มั่งมี', '43.255.63.41', NULL, '2026-02-25 12:28:32'),
(338, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ก้องภพ พรมรส', '43.255.63.41', NULL, '2026-02-25 12:31:56'),
(339, 8, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-25 12:37:32'),
(340, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-25 12:37:53'),
(341, 8, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-25 12:45:37'),
(342, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-25 13:00:15'),
(343, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: บัญชาพล มั่งมี', '43.255.63.8', NULL, '2026-02-25 16:59:36'),
(344, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: บัญชาพล มั่งมี', '43.255.63.8', NULL, '2026-02-25 17:00:11'),
(345, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.118', NULL, '2026-02-26 00:25:10'),
(346, 8, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.118', NULL, '2026-02-26 00:28:02'),
(347, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.118', NULL, '2026-02-26 00:28:46'),
(348, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ปรัชญา บุญถนอม', '43.255.63.32', NULL, '2026-02-26 01:58:45'),
(349, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ศักดา ปาสาเนย์', '43.255.63.67', NULL, '2026-02-26 03:14:15'),
(350, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-26 03:38:40'),
(351, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: จักรภัทร สังวรณ์', '43.255.63.87', NULL, '2026-02-26 04:51:50'),
(352, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: นันทวัฒน์ รุ่งสันเทียะ', '43.255.63.90', NULL, '2026-02-26 05:51:55'),
(353, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: บุญญฤทธิ์ ท้าวทอง', '43.255.63.84', NULL, '2026-02-26 06:40:36'),
(354, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ภูมิพัฒน์ เจริญสุข', '43.255.63.90', NULL, '2026-02-26 07:35:37'),
(355, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธนาวุฒิ แก้วขาว', '43.255.63.118', NULL, '2026-02-26 07:41:16'),
(356, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ธวัชชัย ภาคี', '43.255.63.52', NULL, '2026-02-26 08:42:58'),
(357, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ธวัชชัย ภาคี', '43.255.63.52', NULL, '2026-02-26 08:48:58'),
(358, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: วุฒิชัย กลิ่นเมฆ', '43.255.63.52', NULL, '2026-02-26 08:59:11'),
(359, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ปฏิภาณ สีดารักษ์', '43.255.63.102', NULL, '2026-02-26 09:19:28'),
(360, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-26 09:35:43'),
(361, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-26 10:10:37'),
(362, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ก้องภพ พรมรส', '43.255.63.53', NULL, '2026-02-26 11:14:03'),
(363, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ก้องภพ พรมรส', '43.255.63.53', NULL, '2026-02-26 11:24:37'),
(364, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-26 13:33:58'),
(365, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-26 13:34:18'),
(366, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-26 13:36:52'),
(367, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-26 13:37:58'),
(368, 3, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 110 (gfgerger rgergergerg)', '43.255.63.41', NULL, '2026-02-26 13:59:29'),
(369, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-26 14:44:29'),
(370, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.78', NULL, '2026-02-27 00:55:33'),
(371, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ธนาวุฒิ แก้วขาว', '43.255.63.118', NULL, '2026-02-27 05:03:09'),
(372, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 06:39:10'),
(373, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 06:47:50'),
(374, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 10:58:55'),
(375, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 11:00:47'),
(376, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 11:26:57'),
(377, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 12:13:02'),
(378, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 12:20:49'),
(379, 22, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.84', NULL, '2026-02-27 12:35:32'),
(380, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 12:35:43'),
(381, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 13:21:09'),
(382, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 13:48:59'),
(383, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 14:28:21'),
(384, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 14:59:35'),
(385, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 22:28:16'),
(386, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 23:09:17'),
(387, 8, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.76', NULL, '2026-02-27 23:17:12'),
(388, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 23:19:25'),
(389, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 23:22:23'),
(390, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-02-27 23:28:10'),
(391, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: พงษ์ณรินทร์ สุคงเจริญ', '43.255.63.116', NULL, '2026-02-28 06:35:33'),
(392, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-01 02:44:29'),
(393, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-01 09:18:46'),
(394, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-01 20:53:48'),
(395, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-01 20:54:16'),
(396, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-01 20:54:36'),
(397, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-01 20:55:04'),
(398, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-01 20:59:01'),
(399, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-01 21:27:08'),
(400, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-01 21:27:37'),
(401, 3, 'LOGOUT', 'ออกจากระบบ', '43.255.63.41', NULL, '2026-03-01 21:53:23'),
(402, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-01 21:53:42'),
(403, 3, 'LOGOUT', 'ออกจากระบบ', '43.255.63.41', NULL, '2026-03-01 21:53:47'),
(404, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-01 22:20:18'),
(405, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-01 22:36:42'),
(406, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-01 22:54:14'),
(407, 16, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-03-02 02:08:35'),
(408, 16, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 112 (อำนาจ จันทดวง)', '43.255.63.52', NULL, '2026-03-02 02:16:34'),
(409, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 02:24:55'),
(410, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 02:27:08'),
(411, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 02:30:40'),
(412, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 02:58:06'),
(413, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธนาวุฒิ แก้วขาว', '43.255.63.59', NULL, '2026-03-02 03:25:47'),
(414, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: วิศวินทร์ ชมชื่น', '43.255.63.52', NULL, '2026-03-02 03:36:11'),
(415, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 06:17:04'),
(416, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 06:24:21'),
(417, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ก้องภพ พรมรส', '43.255.63.34', NULL, '2026-03-02 06:30:00'),
(418, 16, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-03-02 06:30:47'),
(419, 16, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 115 (กิตติ เทียนกล้าแสง)', '43.255.63.52', NULL, '2026-03-02 06:36:18'),
(420, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: วสันต์ ภูมิสายดร', '43.255.63.118', NULL, '2026-03-02 06:39:26'),
(421, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ปฏิภาณ สีดารักษ์', '43.255.63.34', NULL, '2026-03-02 06:40:37'),
(422, 16, 'ADMIN_CREATE', 'สร้างข้อมูลใหม่โดย Admin ID: 117 (อัมพร มวลคำลา)', '43.255.63.52', NULL, '2026-03-02 06:42:48'),
(423, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธนภัทร วังบุญ', '43.255.63.16', NULL, '2026-03-02 06:56:34'),
(424, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธยศพล น้อยรอด', '43.255.63.38', NULL, '2026-03-02 07:15:34'),
(425, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ณัฐธีร์ ศรีน้ําคํา', '43.255.63.16', NULL, '2026-03-02 07:28:40'),
(426, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: เมธากุล ทับทิม', '43.255.63.8', NULL, '2026-03-02 07:36:09'),
(427, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ศุภกร คำนุช', '43.255.63.44', NULL, '2026-03-02 07:36:57'),
(428, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธนชิต สามสี', '43.255.63.42', NULL, '2026-03-02 07:38:44'),
(429, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: จิรสิน ภามนตรี', '43.255.63.36', NULL, '2026-03-02 07:41:38'),
(430, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: พงศกร ลาภทวี', '43.255.63.98', NULL, '2026-03-02 07:48:00'),
(431, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ปริญญารัฐ กันทะชัยวงศ์', '43.255.63.114', NULL, '2026-03-02 07:54:01'),
(432, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: อัครเดช สุตาสุข', '43.255.63.70', NULL, '2026-03-02 07:57:27'),
(433, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: กุลกฤษ ทองนพเก้า', '43.255.63.96', NULL, '2026-03-02 08:10:06'),
(434, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 08:10:45'),
(435, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: พงษ์เพชร ยารังษี', '43.255.63.16', NULL, '2026-03-02 08:39:45'),
(436, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ชัชฤทธิ์ ทองลีผล', '43.255.63.94', NULL, '2026-03-02 09:31:16'),
(437, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: นิธิพล นุ้ยภักดี', '43.255.63.126', NULL, '2026-03-02 10:57:46'),
(438, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: สุขจรัส เชื้อคำฮด', '43.255.63.20', NULL, '2026-03-02 11:15:29'),
(439, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 12:08:28'),
(440, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ชลิต บุญมี', '43.255.63.9', NULL, '2026-03-02 12:46:50'),
(441, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 14:32:55'),
(442, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 15:15:36'),
(443, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 15:16:26'),
(444, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 15:22:31'),
(445, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: กีรติ ศูนย์กลาง', '43.255.63.104', NULL, '2026-03-02 15:39:11'),
(446, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 16:00:28'),
(447, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-02 22:54:34'),
(448, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: รัฐภูมิ คำแก้ว', '43.255.63.41', NULL, '2026-03-03 00:04:02'),
(449, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 00:04:46'),
(450, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 00:18:12'),
(451, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 00:41:16'),
(452, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: พงศภัค สุขแก้ว', '43.255.63.52', NULL, '2026-03-03 00:52:58'),
(453, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 01:10:57'),
(454, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 01:28:56'),
(455, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 01:48:33'),
(456, 3, 'EDIT_REQUEST', 'แก้ไขคำขอ: พงศภัค สุขแก้ว', '43.255.63.41', NULL, '2026-03-03 01:49:27'),
(457, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 02:27:49'),
(458, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: จตุรงค์ เสนาไทย', '43.255.63.34', NULL, '2026-03-03 02:35:29'),
(459, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 03:09:41'),
(460, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 03:09:58'),
(461, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 03:41:15'),
(462, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ติยากรณ์ นิกรพิทยา', '43.255.63.24', NULL, '2026-03-03 03:41:56'),
(463, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 04:58:05'),
(464, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: รัฐศาสตร์ เเก้วบัวสา', '43.255.63.98', NULL, '2026-03-03 05:38:00'),
(465, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 07:54:56'),
(466, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: สกุลชัย ชำนาญมาก', '43.255.63.84', NULL, '2026-03-03 08:20:50'),
(467, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ธนพัฒน์ พลยามา', '43.255.63.58', NULL, '2026-03-03 08:31:12'),
(468, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: พิษณุ พิมพ์เวิน', '43.255.63.29', NULL, '2026-03-03 08:35:06'),
(469, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 10:00:31'),
(470, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: รัฐภูมิ คำแก้ว', '43.255.63.41', NULL, '2026-03-03 10:04:53'),
(471, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.41', NULL, '2026-03-03 11:08:28'),
(472, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: วัชระ แก้วตา', '43.255.63.86', NULL, '2026-03-03 12:21:29'),
(473, 8, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.12', NULL, '2026-03-03 12:27:27'),
(474, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-04 02:40:44'),
(475, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ปรเมศ พิมสวรรค์', '43.255.63.106', NULL, '2026-03-04 07:48:31'),
(476, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: สถิตย์ภพ นามแสง', '43.255.63.106', NULL, '2026-03-04 08:04:20'),
(477, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ปัญธกานต์ อินธรรม', '43.255.63.106', NULL, '2026-03-04 08:22:56'),
(478, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ก่อเกียรติ ปะเมทะโก', '43.255.63.106', NULL, '2026-03-04 08:35:20'),
(479, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: กิตติภูมิ พลทา', '43.255.63.72', NULL, '2026-03-04 09:13:15'),
(480, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 01:36:31'),
(481, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ณัฐวุฒิ โชติกเวชกุล', '43.255.63.120', NULL, '2026-03-05 02:14:29'),
(482, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: พงศ์พล พลศักดิ์', '43.255.63.52', NULL, '2026-03-05 03:27:49'),
(483, 17, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.52', NULL, '2026-03-05 08:02:02'),
(484, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: สหชัย ภู่ทะวงค์', '43.255.63.77', NULL, '2026-03-05 09:02:35'),
(485, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ยอดชัยสวัสดิ์ ยวงมะณี', '43.255.63.124', NULL, '2026-03-05 10:08:44'),
(486, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 14:01:16'),
(487, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 15:15:33'),
(488, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 15:15:47'),
(489, 8, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 15:21:56'),
(490, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 15:31:38'),
(491, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 15:31:49'),
(492, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 15:53:21'),
(493, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 21:22:26'),
(494, 8, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 21:55:45'),
(495, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 21:56:20'),
(496, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 22:07:47'),
(497, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 22:07:47'),
(498, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 23:19:11'),
(499, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-05 23:19:57'),
(500, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ศิริชัย ชูทรัพย์', '43.255.63.116', NULL, '2026-03-06 02:15:14'),
(501, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ศิริชัย ชูทรัพย์', '43.255.63.116', NULL, '2026-03-06 02:20:48'),
(502, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-06 03:03:47'),
(503, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: ศิริชัย ชูทรัพย์', '43.255.63.116', NULL, '2026-03-06 03:13:23'),
(504, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-06 03:29:31'),
(505, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: สำอางค์ จาบจันทึก', '43.255.63.106', NULL, '2026-03-06 05:10:00'),
(506, 3, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ทดสอบ ระบบ', '43.255.63.75', NULL, '2026-03-06 05:21:43'),
(507, 3, 'EDIT_REQUEST', 'แก้ไขคำขอ: ทดสอบ ระบบ', '43.255.63.75', NULL, '2026-03-06 05:22:27'),
(508, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: เอกพัฒ เพิ่มเติมภคภา', '43.255.63.29', NULL, '2026-03-06 05:24:48'),
(509, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-06 06:08:44'),
(510, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: วรภัค ศุภสวัสดิ์', '43.255.63.106', NULL, '2026-03-06 06:09:12'),
(511, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: เอกพัฒ เพิ่มเติมภคภา', '43.255.63.54', NULL, '2026-03-06 06:33:20'),
(512, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: สิรวิชญ์ เศษสุวรรณ', '43.255.63.18', NULL, '2026-03-06 08:40:37');
INSERT INTO `idcard_audit_logs` (`id`, `user_id`, `action`, `details`, `ip_address`, `user_agent`, `created_at`) VALUES
(513, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: สิทธิชัย หล้าเขียว', '43.255.63.98', NULL, '2026-03-06 12:43:31'),
(514, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.2', NULL, '2026-03-08 01:34:28'),
(515, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: สมพร พรหมมหา', '43.255.63.19', NULL, '2026-03-08 05:19:34'),
(516, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.92', NULL, '2026-03-09 01:16:52'),
(517, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: วรพล วรทัศน์', '43.255.63.114', NULL, '2026-03-09 06:02:44'),
(518, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: อุกฤษฎ์ ชนะสงคราม', '43.255.63.102', NULL, '2026-03-09 08:26:22'),
(519, 0, 'EDIT_REQUEST', 'แก้ไขคำขอ: สกุลชัย ชำนาญมาก', '43.255.63.79', NULL, '2026-03-09 11:33:07'),
(520, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-09 11:33:58'),
(521, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: พีรภัทร วิศิษฐ์สุขสกุล', '43.255.63.60', NULL, '2026-03-09 14:35:38'),
(522, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-09 23:28:42'),
(523, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: อนุชา ธิชากรณ์', '43.255.63.8', NULL, '2026-03-10 03:39:09'),
(524, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ณัฐวุฒิ สีเหลือง', '43.255.63.51', NULL, '2026-03-10 04:11:08'),
(525, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: กิตติโชติ ศรีวาที', '43.255.63.120', NULL, '2026-03-10 06:19:59'),
(526, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-10 08:17:20'),
(527, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.75', NULL, '2026-03-10 10:39:27'),
(528, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ณัฐวุฒิ แซ่ลี้', '43.255.63.2', NULL, '2026-03-10 15:24:09'),
(529, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: นที นาชัยนาค', '43.255.63.2', NULL, '2026-03-10 16:30:03'),
(530, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: รุ่งโรจน์ สมัครเกษตรกิจ', '43.255.63.18', NULL, '2026-03-10 16:32:32'),
(531, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ลัดดา คำหมุน', '43.255.63.62', NULL, '2026-03-11 05:04:21'),
(532, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: กิตติชัย โคตรศรี', '43.255.63.50', NULL, '2026-03-11 05:24:39'),
(533, 17, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.16', NULL, '2026-03-11 05:35:40'),
(534, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: กฤษฎาวุธ วิไลลักษณ์', '43.255.63.4', NULL, '2026-03-11 08:14:57'),
(535, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.125', NULL, '2026-03-11 08:19:34'),
(536, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.125', NULL, '2026-03-11 23:22:51'),
(537, 17, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.16', NULL, '2026-03-12 03:28:02'),
(538, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: กฤตชัย สิงห์สนิท', '43.255.63.39', NULL, '2026-03-12 06:51:13'),
(539, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: พรชัย ไพรพฤกษ์', '43.255.63.98', NULL, '2026-03-12 10:59:28'),
(540, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.125', NULL, '2026-03-13 06:13:46'),
(541, 0, 'SUBMIT_REQUEST', 'ยื่นคำขอใหม่: ณัฐกิตติ์ ทองน้อย', '43.255.63.39', NULL, '2026-03-13 06:44:38'),
(542, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.90', NULL, '2026-03-13 06:59:35'),
(543, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.125', NULL, '2026-03-13 10:10:58'),
(544, 3, 'LOGIN', 'เข้าสู่ระบบสำเร็จ', '43.255.63.125', NULL, '2026-03-13 11:44:06');

-- --------------------------------------------------------

--
-- Table structure for table `idcard_card_types`
--

CREATE TABLE `idcard_card_types` (
  `id` int(11) NOT NULL,
  `type_name` varchar(255) NOT NULL,
  `back_side_info` text DEFAULT NULL COMMENT 'ข้อมูลหลังบัตร'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `idcard_card_types`
--

INSERT INTO `idcard_card_types` (`id`, `type_name`, `back_side_info`) VALUES
(1, 'บัตรประจำตัวเจ้าหน้าที่รัฐ', 'ข้อมูลสำหรับเจ้าหน้าที่รัฐ...'),
(2, 'บัตรประจำตัวเจ้าหน้าที่ของรัฐผู้รับบำเหน็จบำนาญ', 'ข้อมูลสำหรับผู้รับบำเหน็จบำนาญ...'),
(3, 'บัตรพนักงานราชการ', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `idcard_logs`
--

CREATE TABLE `idcard_logs` (
  `id` int(11) NOT NULL,
  `user_type` varchar(20) NOT NULL COMMENT 'ADMIN (เจ้าหน้าที่), PUBLIC (ประชาชน), GUEST (ผู้เยี่ยมชม)',
  `user_identifier` varchar(50) NOT NULL COMMENT 'เก็บ admin_id หรือ เลขบัตรประชาชน 13 หลัก',
  `action_type` varchar(50) NOT NULL COMMENT 'เช่น CREATE, UPDATE, DELETE, STATUS_CHANGE, VIEW, LOGIN',
  `target_id` int(11) DEFAULT NULL COMMENT 'ไอดีของคำขอ หรือเป้าหมายที่ถูกกระทำ (request_id)',
  `action_detail` text NOT NULL COMMENT 'ข้อความสรุปการกระทำที่อ่านเข้าใจง่าย',
  `old_data` longtext DEFAULT NULL COMMENT 'ข้อมูลเก่าก่อนแก้ (เก็บเป็น JSON)',
  `new_data` longtext DEFAULT NULL COMMENT 'ข้อมูลใหม่ที่ถูกแก้ (เก็บเป็น JSON)',
  `ip_address` varchar(50) NOT NULL COMMENT 'ไอพีแอดเดรสที่แท้จริง',
  `user_agent` text NOT NULL COMMENT 'ข้อมูลอุปกรณ์และเบราว์เซอร์',
  `created_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `idcard_organizations`
--

CREATE TABLE `idcard_organizations` (
  `id` int(11) NOT NULL,
  `org_name` varchar(255) NOT NULL,
  `parent_id` int(11) DEFAULT NULL COMMENT 'กรณีมีหน่วยงานแม่',
  `is_active` tinyint(1) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `idcard_organizations`
--

INSERT INTO `idcard_organizations` (`id`, `org_name`, `parent_id`, `is_active`) VALUES
(5, 'ภ.จว.ปทุมธานี', NULL, 1),
(6, 'จว.ปทุมธานี', NULL, 1),
(7, 'กก.สืบสวน.ภ.จว.ปทุมธานี', NULL, 1),
(8, '  ', NULL, 1);

-- --------------------------------------------------------

--
-- Table structure for table `idcard_positions`
--

CREATE TABLE `idcard_positions` (
  `id` int(11) NOT NULL,
  `position_name` varchar(255) NOT NULL COMMENT 'ชื่อตำแหน่ง',
  `default_org_id` int(11) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `idcard_positions`
--

INSERT INTO `idcard_positions` (`id`, `position_name`, `default_org_id`, `created_at`) VALUES
(1, 'ผบ.หมู่ กองร้อยควบคุมฝูงชน', 7, '2026-02-16 12:14:24'),
(24, 'ผบ.หมู่ (ป.) สภ.เมืองปทุมธานี', 6, '2026-02-17 09:14:58'),
(25, 'ผบ.หมู่ (สส.) สภ.คูคต', 6, '2026-02-17 09:17:05'),
(26, 'รอง สว.สส.สภ.คูคต', 6, '2026-02-17 09:33:36'),
(28, 'ผบ.หมู่ (ป.) สภ.คูคต', 6, '2026-02-17 09:43:22'),
(29, 'ผบ.หมู่ (ป.) สภ.สวนพริกไทย', 6, '2026-02-17 09:46:01'),
(30, 'รอง สวป.สภ.สวนพริกไทย', 6, '2026-02-17 09:49:59'),
(48, 'สวป.สภ.สวนพริกไทย', 6, '2026-02-18 09:32:28'),
(50, 'รอง สว.อก.สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-02-18 09:38:53'),
(51, 'สว.สส.สภ.คูบางหลวง', 6, '2026-02-18 09:48:40'),
(52, 'รอง สว.(ป.) สภ.เมืองปทุมธานี', 6, '2026-02-18 09:53:36'),
(54, 'สวป.(ชส.) สภ.ลำลูกกา', 6, '2026-02-18 09:56:32'),
(55, 'รอง ผบก. ภ.จว.ปทุมธานี', 8, '2026-02-18 22:41:30'),
(56, 'ผกก.ฝอ.ภ.จว.ปทุมธานี', 8, '2026-02-18 22:41:30'),
(57, 'รอง ผกก.ฝอ.ภ.จว.ปทุมธานี', 8, '2026-02-18 22:41:30'),
(58, 'สว.ฝอ.ภ.จว.ปทุมธานี', 8, '2026-02-18 22:41:30'),
(59, 'รอง สว.ฝอ.ภ.จว.ปทุมธานี', 8, '2026-02-18 22:41:30'),
(60, 'นว.(สบ 1) ผบก.ภ.จว.ปทุมธานี', 8, '2026-02-18 22:41:30'),
(61, 'ผบ.หมู่ ฝอ.ภ.จว.ปทุมธานี', 8, '2026-02-18 22:41:30'),
(62, 'รอง สว.(อก.) ฝอ.ภ.จว.ปทุมธานี', 8, '2026-02-18 22:41:30'),
(63, 'ผบ.หมู่ กก.สส.ภ.จว.ปทุมธานี', 8, '2026-02-18 22:41:30'),
(64, 'รอง สว.(ป.) กก.สส.ภ.จว.ปทุมธานี', 8, '2026-02-18 22:41:30'),
(65, 'รอง สว.(ป.)กก.สส.ภ.จว.ปทุมธานี', 8, '2026-02-18 22:41:30'),
(66, 'รอง สว.(ป.) กก.สส.ภ.จว.ปทุมธานี (191)', 8, '2026-02-18 22:41:30'),
(67, 'ผบ.หมู่ กก.สส.ภ.จว.ปทุมธานี (191)', 8, '2026-02-18 22:41:30'),
(68, 'รอง สว.(สส.) กก.สส.ภ.จว.ปทุมธานี', 8, '2026-02-18 22:41:30'),
(69, 'สำรองราชการ ภ.จว.ปทุมธานี', 8, '2026-02-18 22:41:30'),
(70, 'ผบ.หมู่ กลุ่มงานสอบสวน', 5, '2026-02-18 22:41:30'),
(71, 'ผบ.หมู่ (อก.) สภ.เมืองปทุมธานี', 6, '2026-02-18 22:41:30'),
(72, 'รอง สว.(อก.) สภ.เมืองปทุมธานี', 6, '2026-02-18 22:41:30'),
(73, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.เมืองปทุมธานี', 6, '2026-02-18 22:41:30'),
(74, 'รอง สว.(คผศ.) งานสอบสวน สภ.เมืองปทุมธานี', 6, '2026-02-18 22:41:30'),
(75, 'ผบ.หมู่ (ผช.พงส.) สภ.เมืองปทุมธานี', 6, '2026-02-18 22:41:30'),
(76, 'ผบ.หมู่ (สส.) สภ.เมืองปทุมธานี', 6, '2026-02-18 22:41:30'),
(77, 'รอง สว.(สส.) สภ.เมืองปทุมธานี', 6, '2026-02-18 22:41:30'),
(78, 'ผบ.หมู่ (จร.) สภ.เมืองปทุมธานี', 6, '2026-02-18 22:41:30'),
(79, 'รอง สว.(จร.) สภ.เมืองปทุมธานี', 6, '2026-02-18 22:41:30'),
(80, 'ผบ.หมู่ (ธร.) สภ.ปากคลองรังสิต', 6, '2026-02-18 22:41:30'),
(81, 'ผบ.หมู่ (ป.) สภ.ปากคลองรังสิต', 6, '2026-02-18 22:41:30'),
(82, 'รอง สว.(ป.) สภ.ปากคลองรังสิต', 6, '2026-02-18 22:41:30'),
(83, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.ปากคลองรังสิต', 6, '2026-02-18 22:41:30'),
(84, 'ผบ.หมู่ (คตส.) สภ.ปากคลองรังสิต', 6, '2026-02-18 22:41:30'),
(85, 'รอง สว.(คตส.) สภ.ปากคลองรังสิต', 6, '2026-02-18 22:41:30'),
(86, 'ผบ.หมู่ (ผช.พงส.) สภ.ปากคลองรังสิต', 6, '2026-02-18 22:41:30'),
(87, 'รอง สว.(สส.) สภ.ปากคลองรังสิต', 6, '2026-02-18 22:41:30'),
(88, 'ผบ.หมู่ (สส.) สภ.ปากคลองรังสิต', 6, '2026-02-18 22:41:30'),
(89, 'ผบ.หมู่ (จร.) สภ.ปากคลองรังสิต', 6, '2026-02-18 22:41:30'),
(90, 'รอง สว.(จร.) สภ.ปากคลองรังสิต', 6, '2026-02-18 22:41:30'),
(91, 'รอง สว.(ป.) สภ.สวนพริกไทย', 6, '2026-02-18 22:41:30'),
(92, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.สวนพริกไทย', 6, '2026-02-18 22:41:30'),
(93, 'ผบ.หมู่ (ปจว.ธร.) สภ.สวนพริกไทย', 6, '2026-02-18 22:41:30'),
(94, 'ผบ.หมู่ (ผช.พงส.) สภ.สวนพริกไทย', 6, '2026-02-18 22:41:30'),
(95, 'ผบ.หมู่ (สส.) สภ.สวนพริกไทย', 6, '2026-02-18 22:41:30'),
(96, 'รอง สว.(สส.) สภ.สวนพริกไทย', 6, '2026-02-18 22:41:30'),
(97, 'รอง สว.(จร.) สภ.สวนพริกไทย', 6, '2026-02-18 22:41:30'),
(98, 'ผบ.หมู่ (จร.) สภ.สวนพริกไทย', 6, '2026-02-18 22:41:30'),
(99, 'ผบ.หมู่ (ธร.) สภ.สามโคก', 6, '2026-02-18 22:41:30'),
(100, 'รอง สว.(ป.) สภ.สามโคก', 6, '2026-02-18 22:41:30'),
(101, 'ผบ.หมู่ (ป.) สภ.สามโคก', 6, '2026-02-18 22:41:30'),
(102, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.สามโคก', 6, '2026-02-18 22:41:30'),
(103, 'ผบ.หมู่ (ผช.พงส.) สภ.สามโคก', 6, '2026-02-18 22:41:30'),
(104, 'ผบ.หมู่ (สส.) สภ.สามโคก', 6, '2026-02-18 22:41:30'),
(105, 'รอง สว.(สส.) สภ.สามโคก', 6, '2026-02-18 22:41:30'),
(106, 'ผบ.หมู่ (จร.) สภ.สามโคก', 6, '2026-02-18 22:41:30'),
(107, 'รอง สว.(จร.) สภ.สามโคก', 6, '2026-02-18 22:41:30'),
(108, 'ผบ.หมู่ (ธร.) สภ.ลาดหลุมแก้ว', 6, '2026-02-18 22:41:30'),
(109, 'ผบ.หมู่ (ป.) สภ.ลาดหลุมแก้ว', 6, '2026-02-18 22:41:30'),
(110, 'รอง สว.(ป.) สภ.ลาดหลุมแก้ว', 6, '2026-02-18 22:41:30'),
(111, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.ลาดหลุมแก้ว', 6, '2026-02-18 22:41:30'),
(112, 'รอง สว.(คผศ.) สภ.ลาดหลุมแก้ว', 6, '2026-02-18 22:41:30'),
(113, 'ผบ.หมู่ (ผช.พงส.) สภ.ลาดหลุมแก้ว', 6, '2026-02-18 22:41:30'),
(114, 'ผบ.หมู่ (สส.) สภ.ลาดหลุมแก้ว', 6, '2026-02-18 22:41:30'),
(115, 'รอง สว.(สส.) สภ.ลาดหลุมแก้ว', 6, '2026-02-18 22:41:30'),
(116, 'ผบ.หมู่ (จร.) สภ.ลาดหลุมแก้ว', 6, '2026-02-18 22:41:30'),
(117, 'ผบ.หมู่ (ธร.) สภ.คูบางหลวง', 6, '2026-02-18 22:41:30'),
(118, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.คูบางหลวง', 6, '2026-02-18 22:41:30'),
(119, 'ผบ.หมู่ (คตส.) สภ.คูบางหลวง', 6, '2026-02-18 22:41:30'),
(120, 'ผบ.หมู่ (ป.) สภ.คูบางหลวง', 6, '2026-02-18 22:41:30'),
(121, 'รอง สว.(ป.) สภ.คูบางหลวง', 6, '2026-02-18 22:41:30'),
(122, 'ผบ.หมู่ (ผช.พงส.) สภ.คูบางหลวง', 6, '2026-02-18 22:41:30'),
(123, 'ผบ.หมู่ (สส.) สภ.คูบางหลวง', 6, '2026-02-18 22:41:30'),
(124, 'รอง สว.(สส.) สภ.คูบางหลวง', 6, '2026-02-18 22:41:30'),
(125, 'รอง สว.(จร.) สภ.คูบางหลวง', 6, '2026-02-18 22:41:30'),
(126, 'ผบ.หมู่ (ธร.) สภ.ธัญบุรี', 6, '2026-02-18 22:41:30'),
(127, 'รอง สว.(อก.) สภ.ธัญบุรี', 6, '2026-02-18 22:41:30'),
(128, 'รอง สว.(ป.) สภ.ธัญบุรี', 6, '2026-02-18 22:41:30'),
(129, 'ผบ.หมู่ (ป.) สภ.ธัญบุรี', 6, '2026-02-18 22:41:30'),
(130, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.ธัญบุรี', 6, '2026-02-18 22:41:30'),
(131, 'รอง สว.(คผศ.) สภ.ธัญบุรี', 6, '2026-02-18 22:41:30'),
(132, 'ผบ.หมู่ (ผช.พงส.) สภ.ธัญบุรี', 6, '2026-02-18 22:41:30'),
(133, 'รอง สว.(สส.) สภ.ธัญบุรี', 6, '2026-02-18 22:41:30'),
(134, 'ผบ.หมู่ (สส.) สภ.ธัญบุรี', 6, '2026-02-18 22:41:30'),
(135, 'ผบ.หมู่ (จร.) สภ.ธัญบุรี', 6, '2026-02-18 22:41:30'),
(136, 'รอง สว.(จร.) สภ.ธัญบุรี', 6, '2026-02-18 22:41:30'),
(137, 'ผบ.หมู่ (ธร.) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-02-18 22:41:30'),
(138, 'ผบ.หมู่ (ป.) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-02-18 22:41:30'),
(139, 'รอง สว.(ป.) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-02-18 22:41:30'),
(140, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-02-18 22:41:30'),
(141, 'ผบ.หมู่ (คตส.) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-02-18 22:41:30'),
(142, 'ผบ.หมู่ (ปจว.ธร.) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-02-18 22:41:30'),
(143, 'ผบ.หมู่ (ผช.พงส.) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-02-18 22:41:30'),
(144, 'รอง สว.(สส.) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-02-18 22:41:30'),
(145, 'ผบ.หมู่ (สส.) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-02-18 22:41:30'),
(146, 'ผบ.หมู่ (จร.) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-02-18 22:41:30'),
(147, 'รอง สว.(จร.) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-02-18 22:41:30'),
(148, 'ผบ.หมู่ (ธร.) สภ.คลองหลวง', 6, '2026-02-18 22:41:30'),
(149, 'ผบ.หมู่ (ป.) สภ.คลองหลวง', 6, '2026-02-18 22:41:30'),
(150, 'รอง สว.(ป.) สภ.คลองหลวง', 6, '2026-02-18 22:41:30'),
(151, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.คลองหลวง', 6, '2026-02-18 22:41:30'),
(152, 'ผบ.หมู่ (ปจว.ธร.) สภ.คลองหลวง', 6, '2026-02-18 22:41:30'),
(153, 'รอง สว.(ปจว.ธร.) สภ.คลองหลวง', 6, '2026-02-18 22:41:30'),
(154, 'ผบ.หมู่ (ผช.พงส.) สภ.คลองหลวง', 6, '2026-02-18 22:41:30'),
(155, 'รอง สว.(ผช.พงส.) สภ.คลองหลวง', 6, '2026-02-18 22:41:30'),
(156, 'รอง สว.(สส.) สภ.คลองหลวง', 6, '2026-02-18 22:41:30'),
(157, 'ผบ.หมู่ (สส.) สภ.คลองหลวง', 6, '2026-02-18 22:41:30'),
(158, 'ผบ.หมู่ (จร.) สภ.คลองหลวง', 6, '2026-02-18 22:41:30'),
(159, 'รอง สว.(จร.) สภ.คลองหลวง', 6, '2026-02-18 22:41:30'),
(160, 'ผบ.หมู่ (ธร.) สภ.หนองเสือ', 6, '2026-02-18 22:41:30'),
(161, 'ผบ.หมู่ (ป.) สภ.หนองเสือ', 6, '2026-02-18 22:41:30'),
(162, 'รอง สว.(ป.) สภ.หนองเสือ', 6, '2026-02-18 22:41:30'),
(163, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.หนองเสือ', 6, '2026-02-18 22:41:30'),
(164, 'ผบ.หมู่ (ผช.พงส.) สภ.หนองเสือ', 6, '2026-02-18 22:41:30'),
(165, 'รอง สว.(สส.) สภ.หนองเสือ', 6, '2026-02-18 22:41:30'),
(166, 'ผบ.หมู่ (สส.) สภ.หนองเสือ', 6, '2026-02-18 22:41:30'),
(167, 'รอง สว.(จร.) สภ.หนองเสือ', 6, '2026-02-18 22:41:30'),
(168, 'ผบ.หมู่ (จร.) สภ.หนองเสือ', 6, '2026-02-18 22:41:30'),
(169, 'ผบ.หมู่ (ธร.) สภ.ลำลูกกา', 6, '2026-02-18 22:41:30'),
(170, 'ผบ.หมู่ (ป.) สภ.ลำลูกกา', 6, '2026-02-18 22:41:30'),
(171, 'รอง สว.(ป.) สภ.ลำลูกกา', 6, '2026-02-18 22:41:30'),
(172, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.ลำลูกกา', 6, '2026-02-18 22:41:30'),
(173, 'ผบ.หมู่ (คผศ.) สภ.ลำลูกกา', 6, '2026-02-18 22:41:30'),
(174, 'ผบ.หมู่ (ผช.พงส.) สภ.ลำลูกกา', 6, '2026-02-18 22:41:30'),
(175, 'รอง สว.(ผช.พงส.) สภ.ลำลูกกา', 6, '2026-02-18 22:41:30'),
(176, 'ผบ.หมู่ (สส.) สภ.ลำลูกกา', 6, '2026-02-18 22:41:30'),
(177, 'รอง สว.(สส.) สภ.ลำลูกกา', 6, '2026-02-18 22:41:30'),
(178, 'ผบ.หมู่ (จร.) สภ.ลำลูกกา', 6, '2026-02-18 22:41:30'),
(179, 'รอง สว.(จร.) สภ.ลำลูกกา', 6, '2026-02-18 22:41:30'),
(180, 'ผบ.หมู่ (ธร.) สภ.คูคต', 6, '2026-02-18 22:41:30'),
(181, 'รอง สว.(ธร.) สภ.คูคต', 6, '2026-02-18 22:41:30'),
(182, 'รอง สว.(ป.) สภ.คูคต', 6, '2026-02-18 22:41:30'),
(183, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.คูคต', 6, '2026-02-18 22:41:30'),
(184, 'ผบ.หมู่ (คตส.) สภ.คูคต', 6, '2026-02-18 22:41:30'),
(185, 'รอง สว.(คตส.) สภ.คูคต', 6, '2026-02-18 22:41:30'),
(186, 'ผบ.หมู่ (ปจว.ธร.) สภ.คูคต', 6, '2026-02-18 22:41:30'),
(187, 'ผบ.หมู่ (ผช.พงส.) สภ.คูคต', 6, '2026-02-18 22:41:30'),
(188, 'รอง สว.(ผช.พงส.) สภ.คูคต', 6, '2026-02-18 22:41:30'),
(189, 'รอง สว.(สส.) สภ.คูคต', 6, '2026-02-18 22:41:30'),
(190, 'รอง สว.(จร.) สภ.คูคต', 6, '2026-02-18 22:41:30'),
(191, 'ผบ.หมู่ (จร.) สภ.คูคต', 6, '2026-02-18 22:41:30'),
(192, 'ผบ.หมู่ (ธร.) สภ.คลองสิบสอง', 6, '2026-02-18 22:41:30'),
(193, 'รอง สว.(คผศ.) งานสอบสวน สภ.คลองสิบสอง', 6, '2026-02-18 22:41:30'),
(194, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.คลองสิบสอง', 6, '2026-02-18 22:41:30'),
(195, 'ผบ.หมู่ (คตส.) สภ.คลองสิบสอง', 6, '2026-02-18 22:41:30'),
(196, 'รอง สว.(คตส.) สภ.คลองสิบสอง', 6, '2026-02-18 22:41:30'),
(197, 'ผบ.หมู่ (ป.) สภ.คลองสิบสอง', 6, '2026-02-18 22:41:30'),
(198, 'รอง สว.(ป.) สภ.คลองสิบสอง', 6, '2026-02-18 22:41:30'),
(199, 'รอง สว.(ปจว.ธร.) สภ.คลองสิบสอง', 6, '2026-02-18 22:41:30'),
(200, 'ผบ.หมู่ (ผช.พงส.) สภ.คลองสิบสอง', 6, '2026-02-18 22:41:30'),
(201, 'ผบ.หมู่ (สส.) สภ.คลองสิบสอง', 6, '2026-02-18 22:41:30'),
(202, 'รอง สว.(สส.) สภ.คลองสิบสอง', 6, '2026-02-18 22:41:30'),
(203, 'ผบ.หมู่ (ป.) สภ.คลองห้า', 6, '2026-02-18 22:41:30'),
(204, 'รอง สว.(ป.) สภ.คลองห้า', 6, '2026-02-18 22:41:30'),
(205, 'ผบ.หมู่ (คผศ.) สภ.คลองห้า', 6, '2026-02-18 22:41:30'),
(206, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.คลองห้า', 6, '2026-02-18 22:41:30'),
(207, 'ผบ.หมู่ (ผช.พงส.) สภ.คลองห้า', 6, '2026-02-18 22:41:30'),
(208, 'ผบ.หมู่ (สส.) สภ.คลองห้า', 6, '2026-02-18 22:41:30'),
(209, 'รอง สว.(สส.) สภ.คลองห้า', 6, '2026-02-18 22:41:30'),
(210, 'ผบ.หมู่ (จร.) สภ.คลองห้า', 6, '2026-02-18 22:41:30'),
(529, 'สว.กก.สส.ภ.จว.ปทุมธานี', 8, '2026-03-06 03:34:45'),
(530, 'ผบ.ร้อย (สบ2) กองร้อยควบคุมฝูงชน', 7, '2026-03-06 03:35:17'),
(531, 'รอง สว.กก.สส.ภ.จว.ปทุมธานี', 8, '2026-03-06 03:35:44'),
(540, 'รอง สว.(สอบสวน) สภ.ลาดหลุมแก้ว', 6, '2026-03-06 06:09:12'),
(543, 'ผบ.มว.(สบ 1) กองร้อยควบคุมฝูงชน', 7, '2026-03-06 09:49:18'),
(551, 'สวป.สภ.ธัญบุรี', 6, '2026-03-09 01:27:44'),
(581, 'ผกก.(สอบสวน) กลุ่มงานสอบสวน', 5, '2026-03-09 08:54:28'),
(582, 'รอง สว.(สอบสวน) กลุ่มงานสอบสวน', 5, '2026-03-09 08:55:16'),
(583, 'ผกก.สภ.เมืองปทุมธานี', 6, '2026-03-09 08:56:12'),
(585, 'ผบ.หมู่ (สส.) กก.สส.ภ.จว.ปทุมธานี', 8, '2026-03-09 09:46:47'),
(586, 'ผบ.หมู่ (คผศ.) งานสอบสวน สภ.ประตูน้ำจุฬาฯ', 6, '2026-03-09 09:46:47'),
(587, 'ผบ.หมู่ (จร.) สภ.ประตูน้ำจุฬาฯ', 6, '2026-03-09 09:46:47'),
(588, 'รอง สว.(จร.) สภ.ประตูน้ำจุฬาฯ', 6, '2026-03-09 09:46:47'),
(589, 'ผบก.ภ.จว.ปทุมธานี', 8, '2026-03-09 09:46:47'),
(592, 'ผกก.สส.ภ.จว.ปทุมธานี', 8, '2026-03-09 09:46:47'),
(593, 'รอง ผกก.สส.ภ.จว.ปทุมธานี', 8, '2026-03-09 09:46:47'),
(594, 'สว.สส.ภ.จว.ปทุมธานี', NULL, '2026-03-09 09:46:47'),
(595, 'ผบ.ร้อย (สบ 2 ) กองร้อยควบคุมฝูงชน', 7, '2026-03-09 09:46:47'),
(598, 'รอง สว. กลุ่มงานสอบสวน', 5, '2026-03-09 09:46:47'),
(599, 'รอง ผกก.ป. สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(600, 'รอง ผกก.สส. สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(601, 'รอง ผกก.(สอบสวน) สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(602, 'รอง ผกก.จร. สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(603, 'สวป. สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(604, 'สวป.(ชส.) สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(605, 'สว.สส. สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(606, 'สว.(สอบสวน) สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(607, 'สว.จร. สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(608, 'สว.อก. สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(609, 'รอง สวป. สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(610, 'รอง สวป.(ชส.) สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(611, 'รอง สว.สส. สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(612, 'รอง สว.(สอบสวน) สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(613, 'รอง สว.จร. สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(614, 'รอง สว.ธร. สภ.เมืองปทุมธานี', 6, '2026-03-09 09:46:47'),
(615, 'ผกก.สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(616, 'รอง ผกก.ป. สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(617, 'รอง ผกก.สส. สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(618, 'รอง ผกก.(สอบสวน) สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(619, 'สวป. สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(620, 'สวป.(ชส.) สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(621, 'สว.สส. สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(622, 'สว.(สอบสวน) สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(623, 'สว.อก. สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(624, 'รอง สวป. สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(625, 'รอง สวป.(ชส.) สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(626, 'รอง สว.สส. สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(627, 'รอง สว.(สอบสวน) สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(628, 'รอง สว.จร. สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(629, 'รอง สว.ธร. สภ.ปากคลองรังสิต', 6, '2026-03-09 09:46:47'),
(630, 'ผกก.สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(631, 'รอง ผกก.ป. สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(632, 'รอง ผกก.สส. สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(633, 'รอง ผกก.(สอบสวน) สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(634, 'สวป. สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(635, 'สว.สส. สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(636, 'สว.(สอบสวน) สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(637, 'สว.อก. สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(638, 'รอง สวป. สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(639, 'รอง สวป.(ชส.) สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(640, 'รอง สว.สส. สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(641, 'รอง สว.(สอบสวน) สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(642, 'รอง สว.จร. สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(643, 'รอง สว.ธร. สภ.สวนพริกไทย', 6, '2026-03-09 09:46:47'),
(644, 'ผกก.สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(645, 'รอง ผกก.ป. สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(646, 'รอง ผกก.สส. สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(647, 'รอง ผกก.(สอบสวน) สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(648, 'สวป. สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(649, 'สว.สส. สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(650, 'สว.(สอบสวน) สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(651, 'สว.อก. สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(652, 'รอง สวป. สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(653, 'รอง สวป.(ชส.) สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(654, 'รอง สว.สส. สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(655, 'รอง สว.(สอบสวน) สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(656, 'รอง สว.จร. สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(657, 'รอง สว.ธร. สภ.สามโคก', 6, '2026-03-09 09:46:47'),
(658, 'ผกก.สภ.ลาดหลุมแก้ว', 6, '2026-03-09 09:46:47'),
(659, 'รอง ผกก.ป. สภ.ลาดหลุมแก้ว', 6, '2026-03-09 09:46:47'),
(660, 'รอง ผกก.สส. สภ.ลาดหลุมแก้ว', 6, '2026-03-09 09:46:47'),
(661, 'รอง ผกก.(สอบสวน) สภ.ลาดหลุมแก้ว', 6, '2026-03-09 09:46:47'),
(662, 'สวป. สภ.ลาดหลุมแก้ว', 6, '2026-03-09 09:46:47'),
(663, 'สว.สส. สภ.ลาดหลุมแก้ว', 6, '2026-03-09 09:46:47'),
(664, 'สว.(สอบสวน) สภ.ลาดหลุมแก้ว', 6, '2026-03-09 09:46:47'),
(665, 'สว.อก. สภ.ลาดหลุมแก้ว', 6, '2026-03-09 09:46:47'),
(666, 'รอง สวป. สภ.ลาดหลุมแก้ว', 6, '2026-03-09 09:46:47'),
(667, 'รอง สวป.(ชส.) สภ.ลาดหลุมแก้ว', 6, '2026-03-09 09:46:47'),
(668, 'รอง สว.สส. สภ.ลาดหลุมแก้ว', 6, '2026-03-09 09:46:47'),
(669, 'รอง สว.จร. สภ.ลาดหลุมแก้ว', 6, '2026-03-09 09:46:47'),
(670, 'รอง สว.ธร. สภ.ลาดหลุมแก้ว', 6, '2026-03-09 09:46:47'),
(671, 'ผกก.สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(672, 'รอง ผกก.ป. สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(673, 'รอง ผกก.สส. สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(674, 'รอง ผกก.(สอบสวน) สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(675, 'สวป. สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(676, 'สว.สส. สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(677, 'สว.(สอบสวน) สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(678, 'สว.อก. สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(679, 'รอง สวป. สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(680, 'รอง สวป.(ชส.) สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(681, 'รอง สว.สส. สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(682, 'รอง สว.(สอบสวน) สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(683, 'รอง สว.จร. สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(684, 'รอง สว.ธร. สภ.คูบางหลวง', 6, '2026-03-09 09:46:47'),
(685, 'ผกก.สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(686, 'รอง ผกก.ป. สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(687, 'รอง ผกก.สส. สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(688, 'รอง ผกก.(สอบสวน) สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(689, 'สวป. สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(690, 'สวป.(ชส.) สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(691, 'สว.สส. สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(692, 'สว.(สอบสวน) สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(693, 'สว.อก. สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(694, 'รอง สวป. สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(695, 'รอง สวป.(ชส.) สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(696, 'รอง สว.สส. สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(697, 'รอง สว.(สอบสวน) สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(698, 'รอง สว.จร. สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(699, 'รอง สว.ธร. สภ.ธัญบุรี', 6, '2026-03-09 09:46:47'),
(700, 'ผกก.สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(701, 'รอง ผกก.ป. สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(702, 'รอง ผกก.สส. สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(703, 'รอง ผกก.(สอบสวน) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(704, 'สวป. สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(705, 'สวป.(ชส.) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(706, 'สว.สส. สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(707, 'สว.(สอบสวน) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(708, 'สว.อก. สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(709, 'รอง สวป. สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(710, 'รอง สวป.(ชส.) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(711, 'รอง สว.สส. สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(712, 'รอง สว.(สอบสวน) สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(713, 'รอง สว.จร. สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(714, 'รอง สว.ธร. สภ.ประตูน้ำจุฬาลงกรณ์', 6, '2026-03-09 09:46:47'),
(715, 'ผกก.สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(716, 'รอง ผกก.ป. สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(717, 'รอง ผกก.สส. สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(718, 'รอง ผกก.(สอบสวน) สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(719, 'สวป. สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(720, 'สวป.(ชส.) สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(721, 'สว.สส. สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(722, 'สว.(สอบสวน) สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(723, 'สว.จร. สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(724, 'สว.อก. สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(725, 'รอง สวป. สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(726, 'รอง สวป.(ชส.) สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(727, 'รอง สว.สส. สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(728, 'รอง สว.(สอบสวน) สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(729, 'รอง สว.จร. สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(730, 'รอง สว.ธร. สภ.คลองหลวง', 6, '2026-03-09 09:46:47'),
(731, 'ผกก.สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(732, 'รอง ผกก.ป. สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(733, 'รอง ผกก.สส. สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(734, 'รอง ผกก.(สอบสวน) สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(735, 'สวป. สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(736, 'สว.สส. สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(737, 'สว.(สอบสวน) สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(738, 'สว.อก. สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(739, 'รอง สวป. สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(740, 'รอง สวป.(ชส.) สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(741, 'รอง สว.สส. สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(742, 'รอง สว.(สอบสวน) สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(743, 'รอง สว.จร. สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(744, 'รอง สว.ธร. สภ.หนองเสือ', 6, '2026-03-09 09:46:47'),
(745, 'ผกก.สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(746, 'รอง ผกก.ป. สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(747, 'รอง ผกก.สส. สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(748, 'รอง ผกก.(สอบสวน) สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(749, 'สวป. สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(750, 'สว.สส. สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(751, 'สว.(สอบสวน) สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(752, 'สว.อก. สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(753, 'รอง สวป. สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(754, 'รอง สวป.(ชส.) สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(755, 'รอง สว.สส. สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(756, 'รอง สว.(สอบสวน) สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(757, 'รอง สว.จร. สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(758, 'รอง สว.ธร. สภ.ลำลูกกา', 6, '2026-03-09 09:46:47'),
(759, 'ผกก.สภ.คูคต', 6, '2026-03-09 09:46:47'),
(760, 'รอง ผกก.ป. สภ.คูคต', 6, '2026-03-09 09:46:47'),
(761, 'รอง ผกก.สส. สภ.คูคต', 6, '2026-03-09 09:46:47'),
(762, 'รอง ผกก.(สอบสวน) สภ.คูคต', 6, '2026-03-09 09:46:47'),
(763, 'สวป. สภ.คูคต', 6, '2026-03-09 09:46:47'),
(764, 'สวป.(ชส.) สภ.คูคต', 6, '2026-03-09 09:46:47'),
(765, 'สว.สส. สภ.คูคต', 6, '2026-03-09 09:46:47'),
(766, 'สว.(สอบสวน) สภ.คูคต', 6, '2026-03-09 09:46:47'),
(767, 'สว.อก. สภ.คูคต', 6, '2026-03-09 09:46:47'),
(768, 'รอง สวป. สภ.คูคต', 6, '2026-03-09 09:46:47'),
(769, 'รอง สวป.(ชส.) สภ.คูคต', 6, '2026-03-09 09:46:47'),
(770, 'รอง สว.สส. สภ.คูคต', 6, '2026-03-09 09:46:47'),
(771, 'รอง สว.(สอบสวน) สภ.คูคต', 6, '2026-03-09 09:46:47'),
(772, 'รอง สว.จร. สภ.คูคต', 6, '2026-03-09 09:46:47'),
(773, 'รอง สว.ธร. สภ.คูคต', 6, '2026-03-09 09:46:47'),
(774, 'ผกก.สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(775, 'รอง ผกก.ป. สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(776, 'รอง ผกก.สส. สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(777, 'รอง ผกก.(สอบสวน) สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(778, 'สวป. สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(779, 'สว.สส. สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(780, 'สว.(สอบสวน) สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(781, 'สว.อก. สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(782, 'รอง สวป. สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(783, 'รอง สวป.(ชส.) สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(784, 'รอง สว.สส. สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(785, 'รอง สว.(สอบสวน) สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(786, 'รอง สว.จร. สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(787, 'รอง สว.ธร. สภ.คลองสิบสอง', 6, '2026-03-09 09:46:47'),
(788, 'ผกก.สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(789, 'รอง ผกก.ป. สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(790, 'รอง ผกก.สส. สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(791, 'รอง ผกก.(สอบสวน) สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(792, 'สวป. สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(793, 'สว.สส. สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(794, 'สว.(สอบสวน) สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(795, 'สว.อก. สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(796, 'รอง สวป. สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(797, 'รอง สวป.(ชส.) สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(798, 'รอง สว.สส. สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(799, 'รอง สว.(สอบสวน) สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(800, 'รอง สว.จร. สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(801, 'รอง สว.ธร. สภ.คลองห้า', 6, '2026-03-09 09:46:47'),
(820, 'รอง สว.(ป.) สภ.ลำลูกกา', NULL, '2026-03-12 06:51:13');

-- --------------------------------------------------------

--
-- Table structure for table `idcard_print_presets`
--

CREATE TABLE `idcard_print_presets` (
  `id` int(11) NOT NULL,
  `preset_name` varchar(100) NOT NULL,
  `config_data` longtext NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `idcard_print_presets`
--

INSERT INTO `idcard_print_presets` (`id`, `preset_name`, `config_data`, `created_at`) VALUES
(3, 'set2', '{\"baseFontSize\":10,\"govFontSize\":10.5,\"isLocked\":false,\"elements\":{\"photo\":{\"name\":\"รูปถ่าย\",\"x\":2.75,\"y\":2.2,\"w\":25,\"h\":30,\"f\":\"\"},\"gov\":{\"name\":\"คำว่า \\\"ข้าราชการตำรวจ\\\"\",\"x\":44.9,\"y\":0,\"w\":29,\"h\":6,\"f\":\"\"},\"no_lbl\":{\"name\":\"คำว่า \\\"เลขที่\\\"\",\"x\":35,\"y\":4,\"w\":8,\"h\":6,\"f\":\"\"},\"no_val\":{\"name\":\"เลขทะเบียนบัตร\",\"x\":45,\"y\":4,\"w\":38,\"h\":6,\"f\":\"\"},\"name_lbl\":{\"name\":\"คำว่า \\\"ชื่อ\\\"\",\"x\":31,\"y\":10,\"w\":7,\"h\":6,\"f\":\"\"},\"name_val\":{\"name\":\"ยศ-ชื่อ-นาม ↔️\",\"x\":37,\"y\":10,\"w\":48,\"h\":6,\"f\":\"\"},\"pos_lbl\":{\"name\":\"คำว่า \\\"ตำแหน่ง\\\"\",\"x\":31,\"y\":16,\"w\":15,\"h\":6,\"f\":\"\"},\"pos_val\":{\"name\":\"ตำแหน่ง ↔️\",\"x\":45,\"y\":16,\"w\":40,\"h\":6,\"f\":\"\"},\"org_val\":{\"name\":\"สังกัด ↔️\",\"x\":45,\"y\":20,\"w\":39,\"h\":6,\"f\":9.5},\"id_lbl\":{\"name\":\"คำว่า \\\"เลข ปชช.\\\"\",\"x\":31,\"y\":24,\"w\":35,\"h\":6,\"f\":\"\"},\"id_val\":{\"name\":\"เลขบัตร ปชช. (ค่า)\",\"x\":31,\"y\":28,\"w\":53,\"h\":6,\"f\":\"\"},\"app_rank\":{\"name\":\"ยศ (ซ้ายล่าง) ↔️\",\"x\":2.7,\"y\":31,\"w\":15,\"h\":6,\"f\":\"\"},\"app_sig\":{\"name\":\"ลายเซ็น (ผู้ขอ)\",\"x\":9,\"y\":33,\"w\":15,\"h\":8,\"f\":\"\"},\"app_sig_lbl\":{\"name\":\"คำว่า \\\"ลายมือชื่อ\\\"\",\"x\":11,\"y\":39,\"w\":13,\"h\":6,\"f\":\"\"},\"blood_lbl\":{\"name\":\"คำว่า \\\"หมู่โลหิต\\\"\",\"x\":2,\"y\":44,\"w\":12,\"h\":6,\"f\":\"\"},\"blood_val\":{\"name\":\"กรุ๊ปเลือด (ค่า)\",\"x\":16,\"y\":44,\"w\":7,\"h\":6,\"f\":\"\"},\"issue_lbl\":{\"name\":\"คำว่า \\\"วันออกบัตร\\\"\",\"x\":2,\"y\":48,\"w\":16,\"h\":6,\"f\":8.5},\"issue_val\":{\"name\":\"วันออกบัตร (ค่า)\",\"x\":16.5,\"y\":48,\"w\":21,\"h\":6,\"f\":8.5},\"exp_lbl\":{\"name\":\"คำว่า \\\"บัตรหมดอายุ\\\"\",\"x\":37,\"y\":48,\"w\":18,\"h\":6,\"f\":8.5},\"exp_val\":{\"name\":\"บัตรหมดอายุ (ค่า)\",\"x\":54,\"y\":48,\"w\":24,\"h\":6,\"f\":8.5},\"com_rank\":{\"name\":\"ยศ (ผู้ออกบัตร) ↔️\",\"x\":43,\"y\":36,\"w\":12,\"h\":6,\"f\":\"\"},\"com_sig\":{\"name\":\"ลายเซ็น (ผู้ออก)\",\"x\":57.2,\"y\":30.5,\"w\":21,\"h\":15,\"f\":\"\"},\"com_pos_lbl\":{\"name\":\"คำว่า \\\"ตำแหน่ง\\\" (ขวา)\",\"x\":43,\"y\":40,\"w\":15,\"h\":6,\"f\":\"\"},\"com_pos_val\":{\"name\":\"ตำแหน่ง (ผู้ออก) ↔️\",\"x\":56,\"y\":40,\"w\":29,\"h\":6,\"f\":\"\"},\"com_lbl\":{\"name\":\"คำว่า \\\"ผู้ออกบัตร\\\"\",\"x\":57.5,\"y\":44,\"w\":15,\"h\":6,\"f\":\"\"},\"ins_sig\":{\"name\":\"ลายเซ็น(ผู้ตรวจ)\",\"x\":74.2,\"y\":48,\"w\":10,\"h\":6,\"f\":\"\"}}}', '2026-02-17 14:24:21');

-- --------------------------------------------------------

--
-- Table structure for table `idcard_ranks`
--

CREATE TABLE `idcard_ranks` (
  `id` int(11) NOT NULL,
  `rank_name` varchar(100) NOT NULL,
  `rank_short` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `idcard_ranks`
--

INSERT INTO `idcard_ranks` (`id`, `rank_name`, `rank_short`) VALUES
(1, 'พ.ต.อ.', NULL),
(2, 'พ.ต.ท.', NULL),
(3, 'พล.ต.ต.', NULL),
(4, 'พ.ต.อ.', NULL),
(5, 'พ.ต.ท.', NULL),
(6, 'พ.ต.ต.', NULL),
(7, 'ร.ต.อ.', NULL),
(8, 'ร.ต.ท.', NULL),
(9, 'ร.ต.ต.', NULL),
(10, 'ด.ต.', NULL),
(11, 'จ.ส.ต.', NULL),
(12, 'ส.ต.อ.', NULL),
(13, 'ส.ต.ท.', NULL),
(14, 'ส.ต.ต.', NULL),
(15, 'พล.ต.ต.หญิง ', NULL),
(16, 'พ.ต.อ.หญิง ', NULL),
(17, 'พ.ต.ท.หญิง ', NULL),
(18, 'พ.ต.ต.หญิง ', NULL),
(19, 'ร.ต.อ.หญิง ', NULL),
(20, 'ร.ต.ท.หญิง ', NULL),
(21, 'ร.ต.ต.หญิง ', NULL),
(22, 'ด.ต.หญิง ', NULL),
(23, 'จ.ส.ต.หญิง ', NULL),
(24, 'ส.ต.อ.หญิง ', NULL),
(25, 'ส.ต.ท.หญิง ', NULL),
(26, 'ส.ต.ต.หญิง ', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `idcard_requests`
--

CREATE TABLE `idcard_requests` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `rank_id` int(11) NOT NULL,
  `org_id` int(11) NOT NULL,
  `card_type_id` int(11) NOT NULL,
  `full_name` varchar(255) NOT NULL,
  `id_card_number` varchar(13) NOT NULL,
  `request_year` int(4) DEFAULT NULL,
  `blood_type` varchar(10) DEFAULT NULL,
  `photo_path` varchar(255) NOT NULL,
  `status` varchar(50) NOT NULL DEFAULT 'PENDING_CHECK',
  `reject_reason` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `written_at` varchar(100) DEFAULT NULL COMMENT 'เขียนที่',
  `birth_date` date DEFAULT NULL COMMENT 'วันเกิด',
  `age` int(3) DEFAULT NULL COMMENT 'อายุ (ปี)',
  `nationality` varchar(50) DEFAULT 'ไทย' COMMENT 'สัญชาติ',
  `address_json` text DEFAULT NULL COMMENT 'เก็บที่อยู่ทั้งหมดเป็น JSON',
  `contact_address_type` enum('SAME','OTHER') DEFAULT 'SAME',
  `contact_address_json` text DEFAULT NULL COMMENT 'ที่อยู่ติดต่อ (ถ้าเลือก other)',
  `phone` varchar(20) DEFAULT NULL COMMENT 'เบอร์โทร',
  `officer_type` enum('POLICE','PERMANENT_EMP','GOV_EMP') DEFAULT NULL COMMENT 'ประเภทเจ้าหน้าที่',
  `position` varchar(100) DEFAULT NULL COMMENT 'ตำแหน่ง',
  `request_reason` varchar(50) DEFAULT NULL COMMENT 'สาเหตุการขอ (NEW, RENEW, CHANGE)',
  `request_reason_detail` text DEFAULT NULL COMMENT 'รายละเอียดสาเหตุ (เช่น บัตรหาย, เลื่อนยศ)',
  `signature_file` varchar(255) DEFAULT NULL COMMENT 'path ไฟล์ลายเซ็น',
  `documents_json` text DEFAULT NULL COMMENT 'path ไฟล์แนบทั้งหมดเป็น JSON',
  `request_reason_other` text DEFAULT NULL COMMENT 'เหตุผลอื่นๆ',
  `old_card_number` varchar(50) DEFAULT NULL COMMENT 'เลขบัตรเดิม',
  `issuer_id` int(11) DEFAULT NULL COMMENT 'ID ผู้ออกบัตร ณ ขณะนั้น',
  `inspector_id` int(11) DEFAULT NULL COMMENT 'ID ผู้ตรวจบัตร ณ ขณะนั้น',
  `card_sequence` int(11) DEFAULT NULL COMMENT 'ลำดับการออกบัตร (รันนิ่ง)',
  `card_year` int(11) DEFAULT NULL COMMENT 'ปี พ.ศ. ที่ออกบัตร',
  `generated_card_no` varchar(50) DEFAULT NULL COMMENT 'เลขทะเบียนบัตรที่ประกอบร่างแล้ว (เช่น 0001/2567)',
  `print_count` int(11) DEFAULT 0,
  `issue_date` date DEFAULT NULL COMMENT 'วันออกบัตร',
  `expire_date` date DEFAULT NULL COMMENT 'วันหมดอายุ (9999-12-31 = ตลอดชีพ)'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `idcard_running_numbers`
--

CREATE TABLE `idcard_running_numbers` (
  `year_buddhist` int(4) NOT NULL,
  `last_number` int(11) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `idcard_settings`
--

CREATE TABLE `idcard_settings` (
  `setting_key` varchar(50) NOT NULL,
  `setting_value` text DEFAULT NULL,
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `idcard_settings`
--

INSERT INTO `idcard_settings` (`setting_key`, `setting_value`, `updated_at`) VALUES
('discord_webhook_url', 'https://discord.com/api/webhooks/1476187621326716999/h2En_uovwyLJy_55vOUaHShPdvI5P9LUU0k1Q6B70nBJJwtGzI2VgEA20wkRvaJYmpWQ', '2026-02-25 12:03:16'),
('inspector_signature', '', '2026-02-16 11:43:07'),
('issuer_name', 'พีรพล โชติกเสถียร', '2026-02-16 11:43:07'),
('issuer_position', 'ผบก.ภ.จว.ปทุมธานี', '2026-02-16 11:43:07'),
('issuer_rank', 'พล.ต.ต.', '2026-02-16 11:43:07'),
('issuer_signature', '', '2026-02-16 11:43:07'),
('line_channel_access_token', '8oQ9TKVWzJgqSQj62lc7T1XR9ET8KGASUmtobDxP0IBTab1U8dpv+aVNR+JY8ZnozPtJL7+h0gq/wFIPz3nvcaCkqRAS5ohUoNtsAjqhvqoYXpmWV+fExudI8tsyxdE8XOjSp8VnYI14lrVzROOaeAdB04t89/1O/w1cDnyilFU=', '2026-02-25 12:18:58'),
('line_last_reset', '2026-03', '2026-03-02 02:16:34'),
('line_msg_count', '20', '2026-03-13 12:47:22'),
('line_token', '', '2026-02-25 11:57:11'),
('line_user_id', 'C88efab30781e089901cdb8d581ad4c2a', '2026-02-25 12:22:37'),
('telegram_bot_token', '', '2026-02-25 11:57:11'),
('telegram_chat_id', '', '2026-02-25 11:57:11');

-- --------------------------------------------------------

--
-- Table structure for table `idcard_signers`
--

CREATE TABLE `idcard_signers` (
  `id` int(11) NOT NULL,
  `signer_type` enum('ISSUER','INSPECTOR') NOT NULL DEFAULT 'ISSUER' COMMENT 'ผู้ออกบัตร หรือ ผู้ตรวจบัตร',
  `rank_name` varchar(50) DEFAULT NULL COMMENT 'ยศ (เฉพาะผู้ออกบัตร)',
  `full_name` varchar(100) NOT NULL COMMENT 'ชื่อ-สกุล / ชื่ออ้างอิง',
  `position` varchar(100) DEFAULT NULL COMMENT 'ตำแหน่ง (เฉพาะผู้ออกบัตร)',
  `signature_path` varchar(255) NOT NULL COMMENT 'ไฟล์ลายเซ็น',
  `is_active` tinyint(1) DEFAULT 0 COMMENT '1=กำลังถูกเลือกใช้งาน',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `idcard_signers`
--

INSERT INTO `idcard_signers` (`id`, `signer_type`, `rank_name`, `full_name`, `position`, `signature_path`, `is_active`, `created_at`) VALUES
(8, 'ISSUER', 'พล.ต.ต.', 'พีรพล โชติกเสถียร', 'ผบก.ภ.จว.ปทุมธานี', '/home/admportalpte/domains/portal.pathumthani.police.go.th/public_html/idcard/../../secure_uploads/setting/sig_issuer_1771419683_6995b82312905.png', 1, '2026-02-18 13:01:23'),
(9, 'INSPECTOR', NULL, 'พ.ต.ต.มนูญรัตน์ ศรีปัจฉิม1', NULL, '/home/admportalpte/domains/portal.pathumthani.police.go.th/public_html/idcard/../../secure_uploads/setting/sig_inspector_1771419755_6995b86b8f26b.png', 1, '2026-02-18 13:02:35');

-- --------------------------------------------------------

--
-- Table structure for table `idcard_staff_roles`
--

CREATE TABLE `idcard_staff_roles` (
  `id` int(11) NOT NULL,
  `console_user_id` int(11) NOT NULL COMMENT 'ID จากตาราง central_users',
  `role` enum('Super_Admin','Admin','Staff','Approver','Admin_HR') NOT NULL,
  `assigned_by` int(11) NOT NULL COMMENT 'ใครเป็นคนแต่งตั้ง',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `idcard_staff_roles`
--

INSERT INTO `idcard_staff_roles` (`id`, `console_user_id`, `role`, `assigned_by`, `created_at`) VALUES
(2, 3, 'Super_Admin', 0, '2026-02-07 12:24:17'),
(3, 8, 'Staff', 3, '2026-02-16 14:52:48'),
(4, 7, 'Staff', 3, '2026-02-16 15:06:29'),
(5, 16, 'Staff', 3, '2026-02-19 03:02:43'),
(6, 17, 'Staff', 3, '2026-02-19 03:34:01');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `idcard_admin_notes`
--
ALTER TABLE `idcard_admin_notes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `idcard_audit_logs`
--
ALTER TABLE `idcard_audit_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `idcard_card_types`
--
ALTER TABLE `idcard_card_types`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `idcard_logs`
--
ALTER TABLE `idcard_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `idcard_organizations`
--
ALTER TABLE `idcard_organizations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `idcard_positions`
--
ALTER TABLE `idcard_positions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `position_name` (`position_name`),
  ADD UNIQUE KEY `position_name_2` (`position_name`);

--
-- Indexes for table `idcard_print_presets`
--
ALTER TABLE `idcard_print_presets`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `idcard_ranks`
--
ALTER TABLE `idcard_ranks`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `idcard_requests`
--
ALTER TABLE `idcard_requests`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_user` (`user_id`),
  ADD KEY `idx_status` (`status`);

--
-- Indexes for table `idcard_running_numbers`
--
ALTER TABLE `idcard_running_numbers`
  ADD PRIMARY KEY (`year_buddhist`);

--
-- Indexes for table `idcard_settings`
--
ALTER TABLE `idcard_settings`
  ADD PRIMARY KEY (`setting_key`);

--
-- Indexes for table `idcard_signers`
--
ALTER TABLE `idcard_signers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `idcard_staff_roles`
--
ALTER TABLE `idcard_staff_roles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_staff` (`console_user_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `idcard_admin_notes`
--
ALTER TABLE `idcard_admin_notes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `idcard_audit_logs`
--
ALTER TABLE `idcard_audit_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=545;

--
-- AUTO_INCREMENT for table `idcard_card_types`
--
ALTER TABLE `idcard_card_types`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `idcard_logs`
--
ALTER TABLE `idcard_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `idcard_organizations`
--
ALTER TABLE `idcard_organizations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `idcard_positions`
--
ALTER TABLE `idcard_positions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=827;

--
-- AUTO_INCREMENT for table `idcard_print_presets`
--
ALTER TABLE `idcard_print_presets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `idcard_ranks`
--
ALTER TABLE `idcard_ranks`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT for table `idcard_requests`
--
ALTER TABLE `idcard_requests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `idcard_signers`
--
ALTER TABLE `idcard_signers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `idcard_staff_roles`
--
ALTER TABLE `idcard_staff_roles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
